[{"app_id": "ballerburg.desktop", "date_created": 1499625352.0, "description": "This is a typical turn-based artillery game (you know, fire your cannons, changing their angle and strength, until they hit the other players' cannons). There is a little extra depth here because you can buy new material and add defenses. \n\nOne thing to note is that the game defaults to having both sides controlled by humans. If you want to play this game on your own, press escape to enter the options and turn on AI control for one side.", "distro": "Fedora", "karma_down": 0, "karma_up": 6, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 3790, "score": 0, "summary": "Neat turn-based artillery game", "user_display": "micah", "version": "1.2.0"}, {"app_id": "ballerburg.desktop", "date_created": 1539707860.0, "description": "Another version of the classic turn-based cannon game. There are thousands of these, some of them are very fun and original. Don't pick this one.\n\n-Very shallow depth of gameplay- One type of cannon, different levels are all basically the same. The \"market\" system is a nice idea but it never became useful.\n\n-No display scaling (or fullscreen)- the screen is tiny on a 4k monitor, and trying to click the cannon to make it fire was a struggle.", "distro": "Fedora", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 9817, "score": 0, "summary": "Thanks to the devs for making a free game. Sorry, it's bad", "user_display": null, "version": "1.2.0"}, {"app_id": "ballerburg.desktop", "date_created": 1651002909.0, "description": "Remind of similar old game which I dont remember the name but have some twists. I did not find a human vs pc mode which would be great to include if it does not have already! \n\nThanks again Made my day much better!", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 481685, "score": 0, "summary": "I had real fun! Thanks!", "user_display": "fox", "version": "1.2.0"}]