[{"app_id": "cain.desktop", "date_created": 1543150540.0, "description": "kubuntu 18.04. I see interface , but can't do anything. Need models for importing. At least this is not educational tool", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 10920, "score": 0, "summary": "it is not for beginners, strictly narrow tool. I am confused", "user_display": null, "version": "1.10"}, {"app_id": "cain.desktop", "date_created": 1596737567.0, "description": "I was able to launch a simulation with the mass action solver and managed to generate a trajectory in just over 1.07 seconds... If you read the description and haven't a clue what the 1st sentence means, and continue to find the entire description had no discernible meaning, still give it a go, and find when you try to open something, there's a directory called \"examples\" in there, where you can find a few example models... but .. then, what...? can't double-click one of them or don't think of trying, conclude there are no models and complain about that in your \"review\"..? Or was it that (didn't check) the models I tried were in Cain format, so you could just \"open\" them, but you wanted ones that you had to select \"import\" instead of \"open\"?\nThis may well be an educational tool, I have little idea. One probably needs to have a good idea what the description means, at least - to determine that.. which I don't. But don't blame the software because you have no clue what it is or does. It looks like it does stuff like it says, but I didn't like chemistry enough to take enough of it to get to a point where this stuff has more than a mere hint of meaning.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 256075, "score": 0, "summary": "Looks ok, probably does what it says it does", "user_display": "Andrew", "version": "1.10"}, {"app_id": "cain.desktop", "date_created": 1488731746.0, "description": "но оно у меня не пашет \n", "distro": "Kali GNU/Linux", "karma_down": 2, "karma_up": 3, "locale": "ru_RU", "rating": 100, "reported": 0, "review_id": 2312, "score": 0, "summary": "приложение хорошее ", "user_display": null, "version": "unknown"}]