[{"app_id": "com.stepmania.StepMania.desktop", "date_created": 1567066547.0, "description": "This app is built for the arcade. If you can build the arcade to match it.\n\nIf you have played and loved DDR(and it's clones) then you will love this one. It is very pure with it's UI and controls. The game will not display any references to the keys required for \"start\" and \"select\".\n\nMy recent usage has been less then ideal with Ubintoo Budgie having an audio issue I have no hope of solving. Outside of that - my experience of past versions of Stepmania - on different systems - is that of a very nicely polished recreation of the arcades I so enjoyed.\n\nDon't forget to add a bigger song library and tweak the settings to suit your style.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_AU", "rating": 80, "reported": 0, "review_id": 77779, "score": 0, "summary": "Great game when working", "user_display": "Dingo", "version": "5.1.0"}, {"app_id": "com.stepmania.StepMania", "date_created": 1614272731.0, "description": "Overall this is a good game....But what bothers me is that it shows a bunch of songs in the pictures for the game...When in reality it only has 3 i think you can download songs for the game but its required to have a folder for that and for some reason when i down loaded this is didn't get a folder in my files\n\nWhich is strange...but like i said its good but some stuff could be updated to look better and exciting for Example:\n\n1. Have some menu music (there is some music but stops playing when you choose a mode to play, it would be better if you could fix that)\n\n2. Problem with the Pause menu: For some reason when i try to put the pause menu it doesn't come up till 3 seconds later, which is a big problem.\n\n3. Fix the damn ranking, the ranking in this game is broken i did one of the songs and only missed 5 notes and it said i got a C- and its annoying cause i did almost all of them with flawless and Perfect.\n\n4. Also the very last thing i want to say is that sometimes the arrow keys wont respond in the game it says i miss or did it to late.\n\n              If you see this fix this and ill fix my review \n                                     - Eddie (My nickname)", "distro": "Endless", "karma_down": 0, "karma_up": 0, "locale": "en_US.utf8", "rating": 60, "reported": 0, "review_id": 345275, "score": 0, "summary": "Good Game But some stuff that need to be fixed", "user_display": "Eddie", "version": "5.1.0"}, {"app_id": "com.stepmania.StepMania", "date_created": 1616721598.0, "description": "3 stars because the version is 5.1-UNKNOWN which is incompatible with Simply Love and that's by far my favourite theme for this game. Other than that, works perfectly, if you're gonna play keyboard use Etterna, but this is incredible for pad play.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 60, "reported": 0, "review_id": 356807, "score": 0, "summary": "Very good game", "user_display": "kalen", "version": "5.1.0"}, {"app_id": "com.stepmania.StepMania", "date_created": 1636408590.0, "description": "It runs pretty well under wayland and fedora 35, you can download songs for it that are community made; there is a archive of them at https://search.stepmaniaonline.net/. \nI love this game and would recommend it!\n\nRecommendations: \n1.\n if you want to play with a keyboard change the keybindings to something like;\nD - (LEFT) | F - (DOWN) |   | J - (UP) | K - (Right)\nThis will allow you to play with 2 hands in a comfortable and familiar manner with which your hands are positioned as if you were about to type.\n\n2. \nlearn how to find and set a comfortable C-Mod speed, it is the rate at which arrows move across your screen.\n\n3.\nswitch to the delta note or arrow skin and bring down the opacity behind the arrows, this will help with reading and focus especially at high speeds (C-MOD 650+)\n\n4. \npractice at higher JUDGE Difficulties, normal is JUDGE = 4,\nif you practice a song at a higher judge say 7 when you go back to normal you will see a huge difference in your accuracy.\n\n5.\nif you are stuck at a song try slowing it down to practice you can do this by enabling extra settings in the main menu.\n\n6.\nIf you need help join the https://projectoutfox.com/ discord forum or just look through the original stepmania forums for awnsers.\n\n7. \nhave fun!", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 436343, "score": 0, "summary": "This game is a great classic rhythm Game!", "user_display": "Alex", "version": "5.1.0"}, {"app_id": "com.stepmania.StepMania", "date_created": 1644868822.0, "description": "Overall it is a nice classic rhythm game, but on gnome wayland, fedora 35, after start it becomes irresponsibe to any actions, can't even close and have to kill from the tty.\nOn Xorg it works flawlessly, but would love to have it work on the modern and power efficient protocol though.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 463269, "score": 0, "summary": "good rhythm game", "user_display": "Reimu Hakurei", "version": "5.1.0"}, {"app_id": "com.stepmania.StepMania", "date_created": 1653506671.0, "description": "Crashes when you try to select added songs.", "distro": "SteamOS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 490035, "score": 0, "summary": "It almost works", "user_display": "Barry Bernsten", "version": "5.1.0-b2 (stable)"}, {"app_id": "com.stepmania.StepMania", "date_created": 1669858418.0, "description": "Controller configuration was also busted. Had to add it to Steam then download a community config to use a controller. Upon entering the main game however, it crashes at the song selection screen.", "distro": "SteamOS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 40, "reported": 0, "review_id": 544074, "score": 0, "summary": "Crashes at song select", "user_display": "Akira", "version": "5.1.0-b2 (stable)"}, {"app_id": "com.stepmania.StepMania", "date_created": 1681351449.0, "description": "alguien me dice como pongo temas aca ????", "distro": "Huayra GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "es_AR", "rating": 100, "reported": 0, "review_id": 580476, "score": 0, "summary": "muy buena pero..", "user_display": "CHOCOGENTE", "version": "5.1.0"}]