[{"app_id": "com.toolstack.Folio", "date_created": 1720431212.0, "description": "It is a note-taking libreware that fits perfectly to GNOME. It also has nice support for languages that are written in other scripts than the Latin script (i.e., Arabic.)\n\nWith the community's contributions, it could be something even more powerful and the mainstream note-taking application for GNOME.", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 627065, "score": 31, "summary": "An excellent note-taking application", "user_display": "محمد", "version": "24.11"}, {"app_id": "com.toolstack.Folio", "date_created": 1719007931.0, "description": "The app is pretty easy to use and looks good. \nTherea are a couple of bugs I faced: I was not able to delete notebooks and there's a missing image resource for the Format button when taking notes.", "distro": "Manjaro Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 625878, "score": 23, "summary": "Nice app with couple of small bugs", "user_display": "Rob", "version": "24.10"}, {"app_id": "com.toolstack.Folio", "date_created": 1710088658.0, "description": "Perfectly designed to fit in with the GNOME desktop environment. It's easy to use, intuitive, and fully-featured. It even has a built-in markdown cheatsheet for a reminder on how to use it to format your text.\n\nIt doesn't sync with cloud providers like how Iotas does with Nextcloud Notes. However, you can change the directory where your notebooks are saved. So you could keep all your notebooks in a folder on your computer that gets synced to the cloud if you wanted to keep a backup copy.\n\nI'd love to see spell check added to the app in future. Also, text overflows horizontally when the app window is made narrow, so you'll probably want to use it maximised. Otherwise, really wonderful work!", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 2, "locale": "en_GB.UTF-8", "rating": 80, "reported": 0, "review_id": 616977, "score": 14, "summary": "The most beautiful note-taking app on Linux", "user_display": "Chris Wood", "version": "24.05"}, {"app_id": "com.toolstack.Folio", "date_created": 1710828168.0, "description": "ngl its best aesthetically looking notes taking app i used till data with usability obvio.\n\nSomethings i noticed:\nThe All Notes Icon and whole text in sidebar is not horizaontally aligned to start properly like the Notebooks text below, idk if its only me.\n\ni love to have a new notebook option at the bottom of sidebar where the trash box lies (e.g. when the sidebar is expanded, + icon with notebook text & when minimized just + icon). cuz i have to toggle menu every time to make the new notebook.\n\nOtherwise everything looks great & elegant", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 100, "reported": 0, "review_id": 617681, "score": 0, "summary": "Aesthetic with Usability", "user_display": "Chetan Shigvan", "version": "24.08"}]