[{"app_id": "com.github.philip_scott.notes-up.desktop", "date_created": 1548291312.0, "description": "I've used this app primarily for putting scenes for novels in a place where they can be stored separately but still easily viewed together. I like the function of placing notebooks within notebooks, as well as the color coding. Being able to search the notebooks has also been a huge plus. In addition, the optional dark themes of the text editor makes writing easier for me.\nOne thing I didn't expect to like was the limited functionality of the text editor (compared to LibreOffice Writer, which was what I previously used for this purpose). It gave me the ability to focus less on my formatting and more on what I was writing. I'd definitely recommend it for things that don't require extreme formatting to make sense.\n(Just something for those of you considering downloading this app for a similar purpose: it doesn't allow you to re-order pages of notes, so they stay where you've created them. I still enjoy using this app though, and it isn't too much of an issue for me.)", "distro": "Fedora", "karma_down": 0, "karma_up": 2, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 14170, "score": 0, "summary": "Excellent and useful!", "user_display": "E.E.Johnson", "version": "1.5.0"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1593358191.0, "description": "Can you please integrate google drive so that we don't lose the data?\n\nI have run into many problems with PC. This kind of integration would help automatically create copies of most research done here.\n\nI would appreciate that. \n- a student.", "distro": "Ubuntu", "karma_down": 6, "karma_up": 11, "locale": "en_IN", "rating": 80, "reported": 0, "review_id": 238858, "score": 0, "summary": "PLease bring cloud integration!", "user_display": "Harsh Jinger", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1595233857.0, "description": "- You have already some buttons, why not add the Formatting as buttons as well?\n- When editing the Page Title, it remains the same as edited the first time. Tried to change it but to no avail. Tried to use a second page, it works on both.\n- The normal paragraphs remain centered.\n- When editing a page and then I want to add a new page it should automatically go into the actual notebook and not in \"Not in a notebook\".\n- If I want to delete a page by right-clicking, it does not work.\n- You could add some pencils (different colors) to draw or to do some notes by hand.\nStill quite a lot of work to do if you want to be professionally accepted.", "distro": "Fedora", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 249384, "score": 0, "summary": "Simplify the Formatting", "user_display": "Vasco F. Gonçalves", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1599214206.0, "description": "TO Harsh Jinger, if you ever read this: \nThe notes are stored as a SQL databse in your home folder. \nYou can change the location to your Google Drive/Nextcloud/Dropbox by using an app called Dconf. Navigate to org - notes - notes-database and change it to your preferred place. This is how I sink it between computers.\n\n\nPhillip Scott is one of my favorite app developers for Elementary/Gnome. I'm obsessed with note apps, and Notes-Up is just my favorite hands down. And I've tried alot of them. He's working on the most important graphics app for Linux's future: Akira UX.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 267160, "score": 0, "summary": "Love it (and a reply to Harsh Jinger)", "user_display": "jayson hache", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1603820636.0, "description": "awesome and stuff", "distro": "Fedora", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 290484, "score": 0, "summary": "good", "user_display": "Aerik Turkal", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1619560765.0, "description": "what an awful application, locking your files away in a postgresql database (good luck with recovery) when you can just use a flatfile CMS via vim and never loose all your work (or have to sort through several dozen files and rename them all, rearrange them in directories and can't even recover them in another instance of the awful app) \n\nThe developer's github says he works for microsoft. Not surprising at all.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 370041, "score": 0, "summary": "terrible", "user_display": "Thomas Leon Highbaugh", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1646582061.0, "description": "To Jayson, \nThanks for the response. Now with a lot more experience than perhaps when I would have written this review. I am more likely to succeed in the endeavour. I will give it a try and I will start tweaking with other such apps as well. \nThanks again. If you ever read this. I am glad you responded.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 100, "reported": 0, "review_id": 468011, "score": 0, "summary": "Reply to Jayson Hache", "user_display": "Reconnaisance", "version": "2.0.2"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1661575407.0, "description": "Bastante estable y en el justo medio entre opciones de personalizacion y secillez. Muy buen software.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "es_MX.utf8utf8", "rating": 100, "reported": 0, "review_id": 512994, "score": 0, "summary": "Muy buena app", "user_display": "Adriel Cardenas", "version": "2.0.6"}, {"app_id": "com.github.philip_scott.notes-up", "date_created": 1666103458.0, "description": "Довольно удобные и настраиваемые заметки, не пойму только как сделать нормальный пронумерованный список...а так всё хорошо", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 80, "reported": 0, "review_id": 530119, "score": 0, "summary": "Удобные замтеи", "user_display": "Chel zelenii", "version": "2.0.6"}]