[{"app_id": "com.github.fontmatrix.Fontmatrix", "date_created": 1718733815.0, "description": "For some reason the update I received last year broke the info tab. Unfortunately that was the most important tab for me next to chart. Guess I'll have to build and compile from source on a previous build. It really is the most used app on my desktop and I haven t needed to buld and compile from source since 2010, so really hoping for the best on that little adventure.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 1, "locale": "en_GB.UTF-8", "rating": 60, "reported": 0, "review_id": 625631, "score": 23, "summary": "I use this app so often!", "user_display": "Judah", "version": "0.9.100"}, {"app_id": "fontmatrix.desktop", "date_created": 1599743819.0, "description": "Tried to import new fonts, downloaded from Google, which apparently worked but it did not show them. Tried also to open LibreOffice, did also not show.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 269690, "score": 0, "summary": "Not working", "user_display": "Vasco F. Gonçalves", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1613577290.0, "description": "Before discovering this product, I was manually loading one font at a time. With pver 200 fonts, you can imagine the time that takes, and I have 3 physical PCs running Ubuntu plus one Virtual Machine on my MacBook Pro. The job was insane. I thought there HAS to be a better way. I searched the Ubuntu Store for \"Font Manager\", and saw this. I tried it, and it made quick work of the font imports. One note: After importing the fonts, I still had some issues with font matching. When I opened the app and looked, I saw that all fonts were installed, but not all were active. So be sure to activate the fonts, after you import them. I have had no problems using this with TTF fonts. Does not work with *.FON fonts.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 342112, "score": 0, "summary": "Excellent product! And you can't beat the price!", "user_display": "Parallels", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1628752443.0, "description": "just hangs with the splash screen. needed to kill\nuninstalled", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 408567, "score": 0, "summary": "just displays the splash screen", "user_display": "Karl Schindler", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1638899299.0, "description": "The UI is broken on Debian 11, Gnome", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 444941, "score": 0, "summary": "Broken UI", "user_display": "Alan Welsh", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1647451605.0, "description": "Font Manager is a better alternative", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 470634, "score": 0, "summary": "Did not work as intended", "user_display": "Debian Live user", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1660155354.0, "description": "Can't seem to select fonts to tag/disable. It looks very different to the versions shown on recommending websites. Perhaps it's that I'm running Xubuntu. Tried and entirely failed to do anything useful with it.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 20, "reported": 0, "review_id": 508931, "score": 0, "summary": "Not useful or intuative on Xubuntu..", "user_display": "Prince", "version": "0.9.99"}, {"app_id": "fontmatrix.desktop", "date_created": 1704499528.0, "description": "Fontmatrix starts up quickly. There is a splash screen: click on it to continue on to the program. You can disable display of the spash screen in Settings. If you do that, the program will then start very quickly. The first time you start the program may take slightly longer while it compiles a list of the fonts installed on your system.\n\nSome features you may want to configure - such as adding more text samples for display. This can be done in Settings or on the Sample screen.\n\nYou will be greeted with your fonts listed in a grid on the right side of the application window. By default, the text used is the name of each font, but this can be changed to any text desired. You can also change the size of the font displayed - this change will be reflected after restarting Fontmatrix.\n\nIf your font is listed, but its text is not displayed in the typeface of the font, try changing the sample text. Many of my typefaces are mostly symbols. In that case, I could see the characters in the proper typeface when looking at the Chart of the font from the Sample display. I did have to select \"Un-mapped Glyphs\" from the drop-down list above the chart.  In this drop-down, your typeface is grouped into sections, will the default one being \"Basic Latin,\" where the regular keyboard characters are located.\n\nTo get to the Sample display, double-clicking on the font name. You can create multiple sets of sample text.  In this Sample display window, click on the Chart button to list the individual characters in the typeface; click on the Info button to view detailed information about the typeface; click on the Activation button to create groups (\"Tags\") of typefaces and activate or deactivate them. FYI, the little P button means Print and the little D button opens the current Chart or Sample in an additional separate window. You can then go back to the font list and choose another typeface, then press the D button on a Chart and on a sample for that typeface. The previous windows for the first typeface remain open.\n\nClick on the Return to List button to return to the list of fonts. The \"Playground\" and \"Compare\" windows (found under the View menu option), are not intuitive to use.\n\nThis application has other features I haven't covered, but it might be worth a look for you. It has some idiosyncrasies that could be ironed out, and overall, Fontmatrix could be more polished, but it's actually a very good application for a version 0.9.100 (technically pre-release)", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 611163, "score": 0, "summary": "Quirky, but Okay", "user_display": "Phillip Bohning", "version": "0.9.100"}, {"app_id": "fontmatrix.desktop", "date_created": 1696681606.0, "description": "Dieses Programm macht mich ein bisschen ratlos. Eine Schriftenverwaltung ist ja für Leute, die ernsthaft grafisch mit Schrift arbeiten, höchst erstrebenswert. Wenn man seine Schriften nach Schriftfamilien und für konkrete Projekte verwendeten Fonts sortieren kann, ist das eine enorme Arbeitserleichterung. Und wenn man damit Fonts temporär aktivieren und deaktivieren kann, entlastet das auch den Computer. Ob und wie das hiermit geht, ist mir aber auch mit der Hilfe-Datei nicht recht klar geworden. Mein OS, Ubuntu Studio, kommt mit einer Unmenge an vorinstallierten Fonts daher, die bei weitem nicht alle wirklich gut und brauchbar sind, da könnte man eine Organisationshilfe gut gebrauchen. Hier habe ich aber nicht mal herausfinden können wie man die Schriften in Gruppen sortiert, was ich zuvor schon - unter Windows und Mac mit Adobe Font Manager und Font Base gemacht habe. Aber wie das hier funktioniert ist mir schleierhaft. Beim Versuch ein Font Book als PDF zu exportieren, also eine Übersicht der installierten Schriftensammlung (so eine Funktion existiert), stürzt das Programm jedes Mal ab. Wenn man einen oder zwei Fonts exportieren will, öffnet sich ein Fenster, in dem man erstmal die Haken vor allen anderen Fonts weg klicken muss, die dort aufgeführt sind. Und das sind in meinem Fall wohl so ungefähr 2.000. Es gibt da offensichtlich auch keine Funktion, die das deaktivieren mehrerer Einträge am Stück ermöglicht. Auch die Gestaltung des GUI finde ich zwar irgendwie schick, aber nicht gerade handlich und sachdienlich. Im Fazit also ein viel versprechendes Programm, das aber derzeit noch eher wenig hält. Ich bevorzuge daher den laut Angaben in den Paketquellen weniger professionellen \"Font Manager\", der aber zumindest die wichtigsten der oben genannten Kriterien ohne Firlefanz zu erfüllen scheint, soweit ich bisher feststellen konnte.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 40, "reported": 0, "review_id": 603431, "score": 0, "summary": "Wenig intuitiv und stürzt gern ab", "user_display": "Michael Bähre", "version": "0.9.100"}, {"app_id": "fontmatrix.desktop", "date_created": 1590166188.0, "description": "je voulais pouvoir activer des polices pour les utiliser notamment dans Inkscape et Writer, mais aucune application ne prend en compte l’activation des polices. \nPourtant je lance Fontmatrix, j’active, et ensuite je lance le programme.\nEt bien sûr aucune aide nulle part", "distro": "Ubuntu", "karma_down": 5, "karma_up": 10, "locale": "fr_FR.UTF-8", "rating": 20, "reported": 0, "review_id": 214926, "score": 0, "summary": "ne fonctionne pas sur la 20.04", "user_display": "Sophie", "version": "0.9.99"}]