[{"app_id": "com.github.zadam.trilium", "date_created": 1659701863.0, "description": "Cloning, wysiwyg editing, note hoisting, note versioning, internet publishing, canvas notes,........\n\nMan, are you serious. This is an ambitious project and I hope it's one that can be maintained as it picks up users. This is going to be, no doubt, the most advanced tree structured writing and journaling software available to GnuLinux users. After having used applications such as \"UltraRecall\" and \"TreeDBNotes Pro\" on the Winddows side, I can say this is a unique project.\n\nI have not run into unmanageable problems with Trilium as I get to know its functionaliies and no doubt I'll find surprises, but the concept is unique and well organized through a beautiful interface and I thought for that alone it deserves 5 start.\ni hope this application draws the attention of avid note users.", "distro": "Debian GNU/Linux", "karma_down": 1, "karma_up": 8, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 507754, "score": 36, "summary": "Powerful, ground breaking, ambitious", "user_display": "me", "version": "0.53.2"}, {"app_id": "com.github.zadam.trilium", "date_created": 1665924135.0, "description": "Only installed, didn't have time to give it a change, yet, already see \"Potentially unsafe\" flag in Flatpak, which makes me feel a bit upset about open source app which looks great.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 529337, "score": 33, "summary": "Will update at some moment", "user_display": "Vitali Kuzmin", "version": "0.55.1"}, {"app_id": "com.github.zadam.trilium", "date_created": 1662665931.0, "description": "I've been looking for an open source alternative to obsidian. This is it and it seems amazing. I'm still getting to know the tools, but everything looks great so far! I hope many users join and support the devs. Thank you very much! Will donate.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 100, "reported": 0, "review_id": 517589, "score": 14, "summary": "very useful tool!", "user_display": null, "version": "0.54.3"}]