[{"app_id": "duplicati.desktop", "date_created": 1607533845.0, "description": "This has been a really great tool that has saved my bacon on several times on different platforms. (Ubuntu 18.04 and Windows 10)\nBuilt to save encrypted backups to the cloud or a local drive. It has lots of options and sane defaults.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 314425, "score": 0, "summary": "A great cross platform tool with lots of options", "user_display": "Derak Kilgo", "version": "2.0.5.1"}, {"app_id": "duplicati.desktop", "date_created": 1615257766.0, "description": "It will be getting better but it has some bad flaws at the moment. I couldn't depend on it. Should be changing in time.\n\nBut, the speed is really great. The UI is easy. Plenty of extras. Great on space.\n\nYes, so its for backups and being unable to depend on it ruins it. If you think its going well, there are some situations where if one happens, your backups won't be running. If you don't check for a year, haha on you.\n\nThey just need to smooth that out. Maybe a year from now at about 2022 it might be 4 or 5 stars by then or before it ends.", "distro": "Fedora", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 349970, "score": 0, "summary": "Some flaws, some amazing things", "user_display": "linux64", "version": "2.0.5.1"}, {"app_id": "duplicati.desktop", "date_created": 1575627239.0, "description": "Einmal angelegte Backup-Jobs lassen sich nicht ohne Weiteres ändern (hab's jedenfalls nicht gefunden), abgebrochene Sicherungen führen zu nicht behebbaren Fehlern. Das ganze Interface ist mir (noch?) zu un-intuitiv. Vielleicht nochmal testen, wenn es aus der Beta raus ist, bis dahin nutze ich DejaDup weiter.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 1, "locale": "de_DE", "rating": 40, "reported": 0, "review_id": 120165, "score": 0, "summary": "Nicht mein Fall", "user_display": "Oliver Jaehn", "version": "2.0.4.23"}]