[{"app_id": "fonts-lindenhill", "date_created": 1555117370.0, "description": "Just what I am looking for.", "distro": "Ubuntu", "karma_down": 2, "karma_up": 6, "locale": "en_GB", "rating": 100, "reported": 1, "review_id": 20105, "score": 0, "summary": "GOOD", "user_display": "Angela Westell", "version": "1.2"}, {"app_id": "fonts-lindenhill", "date_created": 1556127661.0, "description": "If you are a fan of Serif-type fonts, next time you happen to be looking through Google Fonts (900+ and counting! Don'tcha love it?!), go look at Crimson Text, and Cormorant Garamond (there are several Garamonds, but I always liked the Cormorant best). Anyway, look at the super-sharp edges on the Serifs...especially on Crimson Text. Even at bigger sizes like 36-point and up, the edges should hold up beautifully. If not, go back into your System Settings, specifically in Monitor Display, usually. What you want is the \"Hinting\" of the Sub-pixel Anti-aliasing. If you are unfamiliar w/ antialiasing, it makes what you used to always see in 8 and 16-bit game and computer systems in--especially--the diagonal lines...that stair-stepped look. Well, antialiasing helped to change that. And it got even better with the Subpixel version of it. Anyway, if you are unsure of this font, I hope I have helped to convince you. This is well-above-average quality. Jump at chances like these!\n\nMichael C.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 24809, "score": 0, "summary": "Wow! Just LOOK at those Serifs! That is knife-edge sharp!", "user_display": "Michael Carcieri", "version": "1.2"}, {"app_id": "fonts-lindenhill", "date_created": 1567319833.0, "description": "La voy a recomendar a mis colegas de diseño", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_CU", "rating": 100, "reported": 0, "review_id": 78928, "score": 0, "summary": "Es una buena tipografía", "user_display": "Sandor", "version": "1.2"}]