[{"app_id": "frescobaldi.desktop", "date_created": 1559559612.0, "description": "Been using this for about 2 years now and still discover new ways of doing things. Especially now that I feel more and more comfortable with LISP ( Scheme) it's really taking some nifty things to make as standard tools for code snippets.\nThe challenge for myself is now to automate much of the transporting into another instrument - ie. Guitar to Ukulele to multiple keys and instrument tuning .. well hello emacs editor for code testing and compiling - then insertions into my lillypond code snippets.\n A simple interface underpinning a deceptively a powerful language - wonder where it will end.", "distro": "Ubuntu", "karma_down": 8, "karma_up": 19, "locale": "en_AU", "rating": 100, "reported": 0, "review_id": 42275, "score": 0, "summary": "Made testing and looking at the music score dead easy", "user_display": "Mainwally1", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1568625144.0, "description": "The Lillypond language is awesome and Frescobaldi makes it way easier to write.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 84748, "score": 0, "summary": "Great tool for writing scores", "user_display": "Loran", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1576536084.0, "description": "Die Noten lassen sich wunderbar den Bedürfnissen anpassen.\nKlar, strukturiert, und lassen sich wieder geben.\nAuch das Umwandeln in eine SV-Grafik läuft Einwandfrei. (Benötige ich zwar nicht, ist eher etwas für Werbe-Agenturen oder Grafiker)\nIm Nu ist Die Partitur der Seite angepasst.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_CH", "rating": 100, "reported": 0, "review_id": 124596, "score": 0, "summary": "Genial", "user_display": "Benutzer", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1648080045.0, "description": "Was Lilypond stark machen sollte und weswegen man das Eingeben einem GUI bevorzugt, ist, dass man die Konvertierung dem Programm bedenkenlos überlassen können sollte. Aber genau das macht ständig Probleme. Z.B. das manuelle Hinzufügen von Balken macht nicht was es soll. Auch wird mal garnicht die Zeile beendet und geht über das Blatt.\n\nGerade habe ich damit zu kämpfen, dass Lilypond eine viertel Note nicht richtig im Takt platziert. Also auch das ist noch buggy. \n\nIch hätte an sich weniger zu bemängeln, falls es wie bei anderen Programmen hunderte Einträge zu jedem Thema geben würde auf Stackexchange oder sonstigen, doch Lilypond ist leider nur ein Nischenprojekt und man findet wirklich nur paar Einträge wie sonst zu keinem anderen Benutzerprogramm welches ich benutze.\n\nWirklich schade, hat viel potential, aber das Opensource Konzept hat einfach nicht die Resourcen und Motivation , die es für so was braucht.\n\nSo viel Frustration hatte ich lange nicht mehr, obwohl ich Informatiker bin.\n\n Würde auch 100 Euro für ein funktionierndes/gut dokumentiertes Lilypond bezahlen.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 20, "reported": 0, "review_id": 472464, "score": 0, "summary": "Frescobaldi top, Lilypond flop", "user_display": "gamer", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1658665999.0, "description": "Die Methode, Musik über einen Quellcode ein zu geben bzw. zu programmieren, und das dann zu kompilieren, ist speziell und gewöhnungsbedürftig, aber auch unbedingt gewöhnungswürdig. \nDie Dokumentation ist gut, beantwortet fast alle Fragen. Insbesondere die Einführung ist genial gemacht, und es lohnt tatsächlich, die durch zu gehen, bevor man anfängt. Dann gelingt das Erstellen von Noten schnell und gut. \nMehr Aufwand macht es, wenn mit dem Notentext genau eine Seite, mit genau vorgegebenem Seitenrand etc. gefüllt werden soll. Da braucht es immer wieder einen Blick ins Manual, das als pdf und html sowohl online als auch offline verfügbar ist, und in dem eigentlich alles zu finden ist. Reicht das Manual nicht, so gibt es auch noch einige lilipond-Foren, in denen viele Fragen schon beantwortet sind oder neu gestellt werden können. Also: Dokumentation existiert und ist umfangreich und unterstützt einen gut. \nIch kenne auch kommerzielle Notensatzprogramme, die WYSIWYG-Editoren haben. Deren Notenbild ist bei weitem nicht so gut, was sich in Lesbarkeit der Noten widerspiegelt. \nUnd noch kurz zu Frescobaldi: Der Editor unterstützt die Eingabe des Quelltextes, bietet einen Assistenten zur Erstellung des Notengerüstes und auch Funktionen wie transponieren und Code-Schnipsel, die die Eingabe erheblich vereinfachen. Auch super.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 100, "reported": 0, "review_id": 504998, "score": 0, "summary": "Lilipond+Frescobaldi machen, was sie versprechen - und das sehr gut", "user_display": "Christoph", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1572514621.0, "description": "La he usado durante años y es la manera más práctica de relacionarse con Lilypond que he encontrado, después de probar varios intentos fallidos de otros programas. Hay que acostumbrarse al lenguaje de Lilypond, claro, pero este permite controlar detalles de escritura que otros programas no permiten y la escritura alfábetica es más rápida que la selección por mouse de otros programas comerciales. Recomendado.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_ES", "rating": 100, "reported": 0, "review_id": 103908, "score": 0, "summary": "Excellent frontend for Lilypond", "user_display": "Xiao", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1622927824.0, "description": "una porqueria\nla detesto", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_UY", "rating": 20, "reported": 0, "review_id": 385787, "score": 0, "summary": "valentina", "user_display": "ceibal", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1583509528.0, "description": "Je ne sais toujours pas à quoi il sert et en plus il ne veut pas se désinstaller", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 20, "reported": 0, "review_id": 160723, "score": 0, "summary": "aucune compréhension", "user_display": "Karine", "version": "3.0.0"}, {"app_id": "frescobaldi.desktop", "date_created": 1588868323.0, "description": "Très bon logiciel, partitions très claires.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 100, "reported": 0, "review_id": 203142, "score": 0, "summary": "Très utile", "user_display": "Umhambi", "version": "3.0.0"}]