[{"app_id": "io.github.milkshiift.GoofCord", "date_created": 1718674155.0, "description": "Was sick and tired of other third party clients putting customization ahead of privacy. Until I found Goofcord. \n\nI haven't had a single issue yet with this client. Tried everything that's crucial. Screenshare, calls, etc. Works as expected. \n\nHaven't tried the encryption yet. Need someone else using the same client first. Although this is probably THE most important feature in my view. Screw Discord and their joke of a privacy policy.\n\nAlso, HOT DAMN only 7mb of ram usage? Thanks for that. \nHaving a flatpak version is chef's kiss too. \n\nKeep it up please.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 7, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 625570, "score": 44, "summary": "So far so GOOD!", "user_display": "Silverblue", "version": "1.4.3"}, {"app_id": "io.github.milkshiift.GoofCord", "date_created": 1721380354.0, "description": "Goofcord is an amazing third-party Discord client, offering great customization and power through the ability to pick various client mods like Vencord and its plugins. Goofcord's strong focus on privacy is special and makes it stand out with its encryption plugin built into the client. I think it should be a showcase and standard for all other clients to do the same for privacy. Overall, Goofcord makes the experience of using Discord much better, making it feel like you have Discord with superpowers.", "distro": "Vanilla OS", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 100, "reported": 0, "review_id": 627906, "score": 31, "summary": "Goofcord is pretty standout Discord client", "user_display": "Jerry", "version": "1.5.1"}, {"app_id": "io.github.milkshiift.GoofCord", "date_created": 1721909219.0, "description": "It is stable so far and works to much faster than the normal Discord client. Really nice but the name is a little goofy.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 100, "reported": 0, "review_id": 628359, "score": 31, "summary": "Honestly Really Good", "user_display": "Itachi", "version": "1.5.1"}]