[{"app_id": "io.github.jean28518.Linux-Assistant", "date_created": 1699481753.0, "description": "This is a nice little tool but why doesn't this work on Ubuntu 22.04.3 LTS ? it doesn't even open.", "distro": "Ubuntu", "karma_down": 4, "karma_up": 7, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 606202, "score": 25, "summary": "doesn't work for ubuntu", "user_display": "kynize", "version": "v0.3.0"}, {"app_id": "io.github.jean28518.Linux-Assistant", "date_created": 1699525496.0, "description": "Der hilfreiche Assistent für Linux ist eine innovative Lösung mit großem Potenzial nach oben. Dieser Assistent bietet umfassende Unterstützung für Neue oder schon langjährige Linux Nutzer und ermöglicht eine effiziente und reibungslose Einstellung und Nutzung des Betriebssystems.\n\nMit einer Vielzahl von Funktionen und Tools ist der Assistent in der Lage, Benutzern bei einer Vielzahl von Aufgaben zu helfen. Bei Systemoptimierung bietet dieser Assistent eine umfassende Unterstützung.\n\nDarüber hinaus zeichnet sich der Assistent durch seine Benutzerfreundlichkeit und intuitive Benutzeroberfläche aus. \n\nDer Assistent für Linux hat das Potenzial, die Arbeitsweise von Linux-Benutzern zu verbessern und ihnen dabei zu helfen, ihre Produktivität zu steigern. Mit kontinuierlichen Updates und Verbesserungen wird dieser Assistent sicherlich zu einem unverzichtbaren Werkzeug für Linux-Benutzer.\n\nInsgesamt bietet der Assistent für Linux eine zuverlässige und effektive Lösung für alle Linux-Benutzer, die ihre Erfahrung mit dem Betriebssystem verbessern möchten. Mit seinem Potenzial wird dieser Assistent zweifellos weiterhin eine Unterstützung für die Linux-Community bieten.", "distro": "Nobara Linux", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 100, "reported": 0, "review_id": 606233, "score": 0, "summary": "Top Assistent", "user_display": "Ray", "version": "v0.3.0"}]