[{"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1718243358.0, "description": "best cross platform ebook reader imo", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 625135, "score": 23, "summary": "Love it", "user_display": "Patrick Orave", "version": "1.6.7"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1715772212.0, "description": "the minimal and intuitive interface is the strong asset of this e-book reader the only thing missing is keyboard shortcuts and some small things here and there but most of the functionality is work in progress of the koodo reader keep up the good work i will be more than gladly to pay for such a good software", "distro": "Ultramarine Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.utf8", "rating": 100, "reported": 0, "review_id": 622569, "score": 14, "summary": "it's the one i need and the one most people need", "user_display": "stelios markakis", "version": "1.6.6"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1681067635.0, "description": "Very nice UI, nice looking app and lots of configurations.", "distro": "ArcoLinux", "karma_down": 0, "karma_up": 3, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 579678, "score": 13, "summary": "Great !", "user_display": "M2027", "version": "1.5.3"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1683650170.0, "description": "I love Koodo and appreciate all the hard work the devs do to maintain it. Koodo is a book reader that reads practically any book format with a very nice interface, where you can make references, bookmarks, write notes, and a lot of other things. \n\nJust one thing, it is recommended to open books in formats other than pdf, because pdf works in a weird way, it is a kind of window with the Firefox pdf reader.", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 587937, "score": 0, "summary": "The best book reader available", "user_display": "Tryz", "version": "1.5.3"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1684649123.0, "description": "Simple, minimalist. Has all the features i wished for.\nKudos to devs!!", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 590988, "score": 0, "summary": "Great epub reader", "user_display": "Shresth Kumar Lal", "version": "1.5.4"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1686456894.0, "description": "Koodo Reader has a lot of good things going for it. Naturally, most users would like to see a great looking interface and easy-to-navigate menus and functions. Koodo wins on all counts in that department.\n\nPages are presented in a good, legible manner. The user has room to tweet a few things here and there. You can go with the traditional white background with black lettering or click a button in the menu to switch to a black background with white lettering.\n\nThere is a means to write and keep notes and highlight text. This can easily be retrieved from the menu items on the left side of the screen.\n\nMy biggest pet peeve was importing my books. If the .epub or .pdf file was stored in one particular folder, you could highlight them all and start the importing process. But if e-books were nested in individual folders, Koodo had no means to flesh out these files automatically. I had to enter into each folder, click on the .epub or .pdf file and import these items one at a time. \n\nAnother thing lacking is a choice of textured paper background, which is something I've seen in other e-book readers. You have either a plain white or black background.\n\nKoodo features \"bionic reading mode\", a term I was not familiar with. This mode makes the first few letters in each word bold, with the claim it helps the reader read through the text more quickly and with more comprehension. The science is still out whether this works or not. In any case, this is a modern concept I hadn't seen in other readers, so it's up to you whether it's worth your time or not. Personally, I don't think I'll use it but at least there's a choice given to the user.\n\nAll-in-all, Koodo Reader is worth trying out. Probably not a good choice for anyone with an older PC with limited RAM though. But for any modern day laptop or PC, this program should work well. I'm looking forward to any possible improvements or added features.\n\n[Installed on my ancient HP Pressario tower, on 2GB of RAM, using Linux Lite 5.8. I will also be installing a copy onto my much newer Lenovo laptop with 4GB of RAM.]", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 100, "reported": 0, "review_id": 593489, "score": 0, "summary": "A wonderful e-book reader for the Linux community", "user_display": "Norm Meunier", "version": "1.5.5"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1705195980.0, "description": "Very intuitive, minimalist, and exactly what you are looking for. It will even try to take the PDF and create a table of contents for it for you to easily navigate the book. Hightly recommend. Good job to the developer! I will continue to use this as long as it continues to be supported!", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 611856, "score": 0, "summary": "Exactly What You Need", "user_display": "Michael Holley", "version": "1.6.2"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1708788641.0, "description": "Works well enough but TTS doesn't work. Tried launching with --enable-speech-dispatcher and still no bueno. If you don't care about TTS it's pretty nice. Easy to switch between dark and light modes. Pretty much what you'd expect of an ereader.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 615520, "score": 0, "summary": "Ok but no TTS", "user_display": null, "version": "1.6.2 (stable)"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1713982632.0, "description": "It's the best ebook reader that I've used so far", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_IN.UTF-8", "rating": 100, "reported": 0, "review_id": 620739, "score": 0, "summary": "best ebook reader", "user_display": "Anil", "version": "1.6.6"}, {"app_id": "io.github.troyeguo.koodo-reader", "date_created": 1687348251.0, "description": "\"Great program, but there are some significant weaknesses. In tablet and desktop mode, it's impossible to make text selections without the program continuously scrolling. Additionally, there are still some important features missing in order to use the program productively.\"", "distro": "Ultramarine Linux", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 80, "reported": 0, "review_id": 594437, "score": 0, "summary": "Great program, but there are some significant weaknesses\"", "user_display": "Uwe Fromm (Wiesmann)", "version": "1.5.5"}]