[{"app_id": "io.github.GourmandRecipeManager.Gourmand", "date_created": 1661909067.0, "description": "Been using this program/app with Kubuntu for more than 10 years now! (I also used it in older versions of Ubuntu.)\nIt was originally called \"Gourmet Recipe Manager\" many years ago, but this is the latest, and still robust program/app.\n\nThe program/app is really nice because the recipes are searchable by ingredients as well as keywords. Quick & Easy!\nIt also exports the recipes to an HTML format, so I can use them on other OS's like ipads, macbooks, and (heaven-help-me) windows! Easy to add, edit, link to websites, rename, sort, categorize, and (like anything linux) completely customizable with a little internet searching. So glad to see someone re-booted this, and continues to support it many years later! Thanks!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 1, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 514162, "score": 0, "summary": "Fantastic! Used many years now!", "user_display": "pandora", "version": "1.0.0-7"}, {"app_id": "io.github.GourmandRecipeManager.Gourmand", "date_created": 1676838126.0, "description": "Glad to see that this program has been updated. The only thing missing is the cut and paste import option. This was a handy tool, please put back.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 565860, "score": 0, "summary": "Finally", "user_display": "David", "version": "1.0.0"}, {"app_id": "io.github.GourmandRecipeManager.Gourmand", "date_created": 1711143722.0, "description": "So far so good. I have entered two recipes, I can access them and edit them. I love the export featre. It makes great looking pdf files. I wish it would format them like a 3x5 card, but that might be too old fashioned. Thanks for a nice app.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 618004, "score": 0, "summary": "Great Recipe App", "user_display": "Brent", "version": "1.0.0-7"}]