[{"app_id": "io.snapcraft.full-discography-uGnsRKfHRiktsDDMI3Kjnv1B6FvlQMob", "date_created": 1604272412.0, "description": "Does nothing more than what the app is called, you type in an artist and it shows you the diskography. To even listen to tracks you have to purchase the premium edition.", "distro": "Ubuntu", "karma_down": 4, "karma_up": 20, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 295396, "score": 24, "summary": "Okay, basically a search engine for music", "user_display": "Mason", "version": "1.2.0"}, {"app_id": "io.snapcraft.full-discography-uGnsRKfHRiktsDDMI3Kjnv1B6FvlQMob", "date_created": 1607089011.0, "description": "Does a good job of aggregating and presenting music by artist. Easy to use and functions as you might expect from looking at the app images. Tri-column interface comprising artists, artists music and play. Select artist from list to show their recordings and select from resulting list to then show play details.\n\nI have the paid version for Linux and only use this with YouTube, so the following criticisms apply to that:\n\nOn loading the app, instead of just loading, you are presented with an option screen with menu to search, add music folder or load app(which is last and least prominent visually). I thought I had just launched the app, this extra step is more of an annoying hindrance than a convenience. I’m not going to be adding a music folder very often, so I can do that from within the app if need be, just load the app.\n\nSometimes when you click on play for a particular track and that track is not available, play just sticks on whatever was there before. Fair enough, I guessed it wasn’t available but some kind of message to that effect would be more useful.\n\nProbably academic points, as the title suggests, I found myself just using YouTube directly and hardly ever using this app. Maybe force of habit or maybe just nothing too compelling in favour of using the app, anyway, recently it just stopped working. Tried the usual, purge and reinstall(on a couple of different machines), by both Snap and App Image and nothing doing. Heard about issues with youtube-dl so left it for a couple of weeks, same result.\n\nBottom line, not a big deal since I barely use this, so uninstalling again and putting it down to experience.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 40, "reported": 0, "review_id": 312343, "score": 0, "summary": "Something you Think you Might Use but actually Don't", "user_display": "Andy", "version": "1.2.0"}, {"app_id": "io.snapcraft.full-discography-uGnsRKfHRiktsDDMI3Kjnv1B6FvlQMob", "date_created": 1659214485.0, "description": "Do not do noting!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 506536, "score": 0, "summary": "Only 30 sec. More than it need payment", "user_display": "Wagner", "version": "1.2.3"}, {"app_id": "io.snapcraft.full-discography-uGnsRKfHRiktsDDMI3Kjnv1B6FvlQMob", "date_created": 1627916201.0, "description": "nur geldmacherei nicht zu gebrauchen", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 20, "reported": 0, "review_id": 405219, "score": 0, "summary": "nix", "user_display": "thomas gasser", "version": "1.2.3"}]