[{"app_id": "io.snapcraft.foxglove-studio-ful58zxgFPbq11JkdussBgBmBRGMCMUQ", "date_created": 1670956933.0, "description": "Extremely useful for ROS developers. Easily view a bag file, visualize image topics, view raw message topics, plot graphs, save any image msg frame, see all the details like hz or msg type for any topic. Connect to any ROS MASTER URI and listen to the topics. Bruh! Its amazing. Love it", "distro": "Ubuntu", "karma_down": 0, "karma_up": 1, "locale": "en_IN", "rating": 100, "reported": 0, "review_id": 547578, "score": 0, "summary": "A life savior for ROS developers. Truly awesome!", "user_display": "Deep", "version": "1.34.1"}, {"app_id": "io.snapcraft.foxglove-studio-ful58zxgFPbq11JkdussBgBmBRGMCMUQ", "date_created": 1673100973.0, "description": "the above an I could expect be less resources hungry than rviz, but resulted at least in a i7 with iGPU Aris take the same or more resources than RVIZ. Probably the online performance of video streams are a little better than rviz, but not sure. it is a good software and nothing to complaint. Probably the bussines support and customization services worth it.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 80, "reported": 0, "review_id": 553757, "score": 0, "summary": "Far in funcionality of RVIZ but in the good way", "user_display": "iscan", "version": "1.35.2"}, {"app_id": "io.snapcraft.foxglove-studio-ful58zxgFPbq11JkdussBgBmBRGMCMUQ", "date_created": 1677711087.0, "description": "I'm using this to help debug may SLAM implementation. It has a great ROS bag viewer with VCR controls to go back and forward in time. There seem to be frequent updates and an active, vibrant ecosystem. Demonstration in video link https://youtu.be/_Qd8YkFvXkg", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 569115, "score": 0, "summary": "Great tool for ROS2. Appears to be very active", "user_display": "brian", "version": "1.42.1"}]