[{"app_id": "manuskript.desktop", "date_created": 1664599206.0, "description": "dont install from snap store, click the link that takes you to the developer's website. Then download the \".DEB\" package - ignoring the 'snap' package. then right click the file in your downloads direcrory and select \"OPEN WITH SOFTWARE INSTALLER\" option.\n\nFor some reason the snap store package installs directly from the Snap store if you select it, but fails to run. I learned this the hard way, and now I have two versions installed (One that doesn't work.) Downloading the \"DEB\" package directly from the developer works.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 524365, "score": 33, "summary": "Here's how to get it to work on Ubuntu 20.4 LTS", "user_display": "David", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1666218444.0, "description": "I just installed this from the download link from the website.\nIt directed me back to Snap, and opened up no problems.\nGoing to try it out right now.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 530497, "score": 33, "summary": "Download from website. Installed on my Ubuntu 20.4", "user_display": "kevin", "version": "0.10.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1661973890.0, "description": "I was really looking for a tool to build a world for a Role-Playing game, something that will allow me to upload a map and pinpoint locations on the map to add villages and inhabitants etc to. Manuskript is not what I was looking for. However, it looks very complete for anyone who is looking for a tool to help them write, as the description says, though this is just my opinion at a glance.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 514506, "score": 24, "summary": "Looks very complete for story-writing", "user_display": "TrishaP", "version": "0.13.1"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1662083864.0, "description": "Using Ubuntu 20.4. Installed fine, but never opened after clicking on the icon. \nToo bad. Looked promising.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 515158, "score": 24, "summary": "Will not open after install", "user_display": "ANON", "version": "0.13.1"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1557274193.0, "description": "Program does not work. Nothing is displayed.", "distro": "Ubuntu", "karma_down": 17, "karma_up": 47, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 30767, "score": 21, "summary": "Will not launch", "user_display": "Roch", "version": "0.9.0"}, {"app_id": "manuskript.desktop", "date_created": 1658807004.0, "description": "I've yet to dig into it yet, but it took some time to get it to launch in Ubuntu 22\n\nI've been able to implement a patch so far by editing the file \"/usr/share/manuskript/manuskript/functions/__init__.py\". On line 197 I changed:\n\nreturn QColor(r, g, b) if not fromString else QColor(r, g, b).name()\n\nto\n\nreturn QColor(int(r), int(g), int(b)) if not fromString else QColor(int(r), int(g), int(b)).name()", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 505420, "score": 10, "summary": "Got it to open..", "user_display": "Malakai", "version": "0.12.0"}, {"app_id": "manuskript.desktop", "date_created": 1660685295.0, "description": "This works well.\n\nHave run 0.14 on both Kubuntu and Windows. The same files open of both systems. There are many features to help with you book writing. Already used FocusWriter so was very pleased to notice it's embedded in this too.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 80, "reported": 0, "review_id": 510418, "score": 10, "summary": "Feature rich fiction creation", "user_display": "Matthew", "version": "0.14.0-1"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1659752125.0, "description": "At first was happy to find this, I've been looking for this kind of software for a while. But then frustrated that after installing, it just doesn't open. I hope it gets fixed!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_PH.UTF-8", "rating": 20, "reported": 0, "review_id": 507908, "score": 10, "summary": "Doesn't launch on Ubuntu MATE 22.04", "user_display": "JB", "version": "0.13.1"}, {"app_id": "manuskript.desktop", "date_created": 1609196868.0, "description": "Doesn't work on 20.04.1 LTS. Project won't open. Sad.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 321610, "score": 0, "summary": "Poo", "user_display": "Tommy Tolson", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1613304031.0, "description": "This program seems to be a pretty good novel writing project management suite, but the lack of basic qol features like changing the width of the text box and font size in that text box would already ding it... But the problem is that I was almost able to freeze my system by copy-pasting a dozen of pages of text into the program, which slowed it down immensely. That, and the numerous warnings about instability, does not make me confident enough to use this for anything.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 340822, "score": 0, "summary": "Seems to contain all the features I want, but buggy as heck", "user_display": "Kristian", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1622560886.0, "description": "People who have complained or left negative reviews just do not understand what this program is or does. Manuskript is very powerful and performs at the level of Scrivener on linux with good but basic user interface. It tracks chapters, text and folders in a tree, like scrivener, and provides and edit area to the right of that. This can be transformed to full screen mode where nothing but black screen and white or green (or any other color) characters appear as you type with no distracftions. \n\nIt complies the document to .txt or other formats. This is the absolute perfect solution for a lightweight writing app on your linux laptop or machine. \n\nWith one reservation. The program does auto-save your work, but you must set up an auto backup of your work files or folders. This is easy to do. This way, if there is any crash or configuration issue, your work is saved. This is done in scrivener and all the major apps. You set a folder outside of the one where you are saving the workfile as a backup on auto.\n\nPeople who have written negative reviews do not understand that this does precisely what is needed for the novel writer or for any writer. All else is bells and whistles, and things that take up memory and CPU power. The program is not perfect, but it has been around for a very long time and offers comparable features to scrivener or livingwriter for free, on linux. It is a no-brainer. Take the time to go to the website, set up the program properly, configure it, customize it, set up a backup file. If it wont open, upgrade to the most recent app version. One person below says it wont open. I had that experience and then updated to the most recent version and it was perfect. It was a matter of the distro providing an old version, not a matter of the sofware not working. \n\nI have tried almost ever writing program there is. This one provides comparable features to scrivener in terms of the writing, organziation, and compiling. Also index cards and outline views, character notes, the whole 9 yards. But it keeps a minimal GUI and adds nothing required. If you want to work on a linux laptop, where you cannot install scriverner, this is your option if you are not going to use WINE for a windows version of scrivener. Take the time to set it up and read all about it before saying it sucks. It really does not suck at all. It ROCKS!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 384111, "score": 0, "summary": "Amazing app, well worth it if you take the time", "user_display": "joe2", "version": "0.12.0"}, {"app_id": "manuskript.desktop", "date_created": 1623776656.0, "description": "This has a lot of features that I don't want, but I'm sure are helpful for some. The interface coul dbe better optimized for oppening and starting to write. You have to save and add a page to start writing. The full screen icon at the bottom right was hard to find and should be duplicated in the view menu.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 388999, "score": 0, "summary": "A little clunky - but it does what I wanted", "user_display": "Joel", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1631494009.0, "description": "May I add that it does not work with Ubuntu 20.04, in particular the editor does not function.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_AU.UTF-8", "rating": 20, "reported": 0, "review_id": 419352, "score": 0, "summary": "Lament", "user_display": "PEM", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1657354040.0, "description": "Although there can be some issues installing, once installed, this is a fantastic app for structuring any sort of book. The ideas can be stored right there, and can be availed if and when necessary. \n\nThe app structures a book well, although, I'd personally like an even minimal editor. However, if you are an \"architect\" type of writer, this is your full Swiss knife for giving you a scene by scene approach to your writing.\n\nEven for writers who are \"gardeners\", this is an indispensable tool for your second draft editing and refining process.\n\nAnd, all of this is for free. Fully satisfied with this.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 100, "reported": 0, "review_id": 501413, "score": 0, "summary": "An excellent tool for a writer", "user_display": "Pathikrit Ghosh", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1659588659.0, "description": "Takes some time to figure what does what and goes where, but once you get the hang of it, it is the best tool ever. It improves clarity and organisation of writing. I highly recommend it!\n\nTa! loads to the developer.", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_HK.UTF-8", "rating": 100, "reported": 0, "review_id": 507494, "score": 0, "summary": "Great tool for organising", "user_display": "pet", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1561505212.0, "description": "I really love this. Being able to plan things out and see estimated word count of the series, with it separated into books, act structure, chapters, and individual scenes, is a great planning and organising tool. I quite like being able to note down world and character information, in addition to the actual writing of the draft. Really enjoying this app!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_AU", "rating": 100, "reported": 0, "review_id": 52158, "score": 0, "summary": "Works great on Ubuntu 18.04!", "user_display": "PJ Turner", "version": "0.9.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1572802547.0, "description": "World building, character association, description, etc, has never been easier for me, and I am not an organized person. Still getting used to some of the more intricate features and there are 2 buttons that do not actually work (adding theme for focuswriting for example) but thats about it. Thank you for making this program devs.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 80, "reported": 0, "review_id": 105534, "score": 0, "summary": "#1 Book writing and editing app to me", "user_display": "Agnios", "version": "0.10.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1573866914.0, "description": "It has nice features but the layouts are rather deficient, it is better to pop up a new window or a tab rather than laying it out so narrow that you cannot use it well. Some widgets like ListView do not allow resizing the columns which makes it difficult to work with. I am also missing a TOTAL word count of the book and a feature for session targets like Scrivener.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 111183, "score": 0, "summary": "Nice features but needs improvements", "user_display": "Chris Breitling", "version": "0.10.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1583501937.0, "description": "Pretty different from Scrivener, but does most of the things needed.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_SG", "rating": 100, "reported": 0, "review_id": 160672, "score": 0, "summary": "Seems to be the best open source tool in this area", "user_display": "alx", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1585006336.0, "description": "I can't use it for my full experience, since I can only write in English on it and not on my native language. Without support for graphics accents other than English, it's useless.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 169376, "score": 0, "summary": "Program does not accept graphic signs from non-English languages", "user_display": "ianatxt", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1589736596.0, "description": "Create a new story. Enter detail.... nope, that's as far as you get. Why does such rubbish software make it onto the Ubuntu software centre?", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 211260, "score": 0, "summary": "Crashes", "user_display": "Roger Holden", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1590358100.0, "description": "I tried to open a markdown file, and the application immediately closed.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 20, "reported": 0, "review_id": 216624, "score": 0, "summary": "Launches, but immediately closed when open markdown file", "user_display": "Randy", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1613224538.0, "description": "I feel people tend to write a review only when things dont work right. I installed despite the previous reviews. Installed on Ubuntu 20.04.1 LTS, it didnt show up in my launcher with all my apps, however searching for \"manuscript\" showed a settings icon for it and that launched the software just fine. The software has a suprising amount of features. You can decide how many books, sections, chapters, scenes, or words. You can also rename/add/remove these descriptors, as well as change their quantitive values, all the while it will update the overall projected length of your book. It will let you set goals for length, it also shows you your completion to that goal. Creates searchable cheatsheets based on the persons, places or things you create. The software dialogs help break down the process and nudge you to add more, for example, as you created a world or character element during outlining it will ask you to write a sentence to describe said element. Later on if you decide to open and view that element, it shows your descriptive sentence, then it will prompt you to write a paragraph to elaborate on that descriptor. Esentially it tries to help you add to your book one piece at a time to keep you organized. In the end it will allow you to export your finalized and approved excerpts into an organized and formatted manuscript in the file type of your choice.\nI am obviously not a professional writer, I installed just on a random interest like ive done with 100s of other scripts and apps over the years and this one deserved an honorable mention. Hope that helps.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 340448, "score": 0, "summary": "Suprised enough to write a review", "user_display": "dillon", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1624554237.0, "description": "After I updated to 20.04, it stopped functioning - a flicker and no launch. Can't retrieve earlier work... Run away!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 20, "reported": 0, "review_id": 392040, "score": 0, "summary": "No go on 20.04", "user_display": "Larmeau1", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1625845061.0, "description": "I can confirm what Larmeaul says ... it does not work on Ubunto 20.04. Probably need to wait for the 0.12 release is ported?", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 20, "reported": 0, "review_id": 397324, "score": 0, "summary": "Does not work with 20.04", "user_display": "Alex Brown", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1630009439.0, "description": "Just as Larmeul says, does not work under Ubuntu 20.04.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 20, "reported": 0, "review_id": 413733, "score": 0, "summary": "Does not work at all", "user_display": "<jan", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1633029927.0, "description": "I used Manuskript one year ago and it was a very nice software!\nUnfortunately, it seems that upgrading my system to Ubuntu 20.04 broke some dependencies. I will patiently wait for devs to catch up, because I love this soft! In the meantime, I gave it 3 stars, but deserves 5!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 425298, "score": 0, "summary": "5 stars when it is working, 0 when it's not", "user_display": "Becheler", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1652894489.0, "description": "Could not get it to launch in current Ubuntu. Installed and deleted it a few times. If you have better computer skills you may check out github for a fix. I don't have time. It looks like it has some good potential, so I may be back in the future to see if it is farther along in the development stages. Seems kinda beta to have a launch problem where it works for some people and not others. Those for whom it is working seem to like it. TTFN.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 487979, "score": 0, "summary": "Doesn't launch. Deleting. May try again in the future", "user_display": "Pedar", "version": "0.12.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1654449893.0, "description": "I installed it on Kubuntu 22.00. The program is running after the network-manager permission is enabled. Unfortunately, there are some problems in editor mode. Keep update!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 492884, "score": 0, "summary": "Not work well!", "user_display": "Abdiansah", "version": "0.12.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1655003837.0, "description": "Looks like it could be great, but can't tell because it won't launch", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 494635, "score": 0, "summary": "Doesn't launch on Ubuntun 22.04 LTS", "user_display": "Joe", "version": "0.13.1"}, {"app_id": "manuskript.desktop", "date_created": 1663056696.0, "description": "Wollte auf diesen Weg euch kurz helfen, nach dem update ging bei mir auch nichts mehr, aber wenn man es direkt auf der Seite downloadet dann geht es wieder. https://www.theologeek.ch/manuskript/download/ ist der link dazu. Nicht vergessen in Tilix in den Download Ordner zu wechseln. Dann der beschreibung folgen und nun geht es wieder. Somit könnt ihr auch wieder auf eure .msk Daten zugreifen. Hoffe ich konnte euch helfen. Ich bin froh, das es wieder funktioniert.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 100, "reported": 0, "review_id": 518971, "score": 24, "summary": "Schönes Programm!", "user_display": "dom", "version": "0.12.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1594455405.0, "description": "Große Hilfe beim Organisieren von Nebensächlichkeiten, mit den man eigentlich nicht viel zu tun haben will - großes Dankeschön an die Entwickler!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 100, "reported": 0, "review_id": 245646, "score": 0, "summary": "Das ist der Gipfel - was für eine Arbeitserleichterung!", "user_display": "UB", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1621084615.0, "description": "Super-Programm für Autor*innen, aber trotz mehrfacher (Re-)Installationen und der Suche nach Bugfixes seit etwa 04/2021 unbrauchbar. Dadurch sind mir leider Daten verloren gegangen, die ich zwar als msk-File gesichert hatte, aber nun nicht mehr öffnen kann. Sehr schade, denn eigentlich ist es eine tolle Anwendung, aber so unbrauchbar.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_CH", "rating": 40, "reported": 0, "review_id": 377344, "score": 0, "summary": "Leider seit 04/ 2021 unbrauchbar", "user_display": "Rosen Ferreira", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1632738604.0, "description": "war eine tolle Arbeitserleichterung; hat vor allem den Schreibstart leicht gemacht. Leider schließt sich das Programm jetzt immer wieder von allein während des Öffnens. Mehrmals neu installiert; hilft nichts. Bin für Tipps dankbar.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 60, "reported": 0, "review_id": 424119, "score": 0, "summary": "klasse, bis jetzt; es schließt sich immer wieder von allein", "user_display": "Sina", "version": "0.11.0"}, {"app_id": "manuskript.desktop", "date_created": 1643081624.0, "description": "A veces funciona bien y otras se cierra en cuestión de segundos. Dicho de otro modo, no puedes trabajar cuando quieres, sino cuando el programa quiere. No lo recomiendo para nada.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_MX.UTF-8", "rating": 20, "reported": 0, "review_id": 457654, "score": 0, "summary": "Imposible de usar", "user_display": "Onirambulo", "version": "0.13.1"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1667730202.0, "description": "Solution pour Ubuntu : dans Ubuntu Software (version snap) après installation cliquer sur le bouton \"permissions\" et cocher la ligne concernant \"Network manager\"\nSolution pour autre distribution affectée :\nEntrer dans un terminal\nsnap connect manuskript:network-manager :network-manager\n\nvoir bug https://github.com/olivierkes/manuskript/issues/969", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 60, "reported": 0, "review_id": 536407, "score": 41, "summary": "Bug : pour la lancer dans Ubuntu nécessite permission Network manager", "user_display": "user1", "version": "0.13.1"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1664093410.0, "description": "Vraiment dommage. Obligé de migrer sur wimdows ! \nLà, ça marche", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_CH.UTF-8", "rating": 20, "reported": 0, "review_id": 522697, "score": 33, "summary": "ne fonctionne plus", "user_display": "Helga", "version": "0.14.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1666647976.0, "description": "Logiciel sympa. Pour ceux qui ne peuvent plus le lancer, j'ai dû \ncocher 'network-manager' dans les permissions pour pouvoir \nle l'essayer.", "distro": "Linux Mint", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 80, "reported": 0, "review_id": 532153, "score": 31, "summary": "permissions", "user_display": "edcp", "version": "0.13.1"}, {"app_id": "manuskript.desktop", "date_created": 1637968243.0, "description": "Je ne sais pas ce qui se passe, mais l'appli ne marche plus ces derniers temps...\nDommage, quand elle marchait, elle était super !", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 40, "reported": 0, "review_id": 441790, "score": 0, "summary": "Dommage", "user_display": "Agnès", "version": "0.10.0"}, {"app_id": "manuskript.desktop", "date_created": 1652572830.0, "description": "fonctionnait jusqu'alors très bien, mais semble ne plus s'ouvrir avec Ubuntu 20-10...", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 80, "reported": 0, "review_id": 486828, "score": 0, "summary": "très bien... mais", "user_display": "moonwolf", "version": "0.12.0"}, {"app_id": "manuskript.desktop", "date_created": 1653469920.0, "description": "Au départ, je ne l'utilisais que partiellement. \nMais avec le temps, on comprend qu'il a été consu par un ecrivain et qu'il est remplit d'astuses pour créer et gérer un roman.\nAujourd'hui, je l'utilise à 100%", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_CH.UTF-8", "rating": 100, "reported": 0, "review_id": 489854, "score": 0, "summary": "Intérésante application", "user_display": "Jean", "version": "0.12.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1579946932.0, "description": "Il y avait longtemps que je cherchais une application pour m'aider à m'organiser dans mon écriture. Je l'ai trouvée : celle-là.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 100, "reported": 0, "review_id": 141855, "score": 0, "summary": "Parfaite", "user_display": "Louis Leblanc", "version": "0.10.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1592592095.0, "description": "L'app n'ouvre pas les PDF encore moins le scrpt java", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_CA", "rating": 20, "reported": 0, "review_id": 233773, "score": 0, "summary": "pas pour xubuntu", "user_display": "r2d2**", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1633984005.0, "description": "mais apparament pas bien en 21.04...", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 40, "reported": 0, "review_id": 428276, "score": 0, "summary": "fonctionait fort bien en 20.04..", "user_display": "moonwolf", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1650976901.0, "description": "L'écriture est souvent une question d'organisation des idées. Cet outils pourra éventuellement aider des auteurs qui n'ont pas envie d'encombrer leur bureau avec des notes éparses.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 80, "reported": 0, "review_id": 481574, "score": 0, "summary": "Aide à l'écriture fonctionnelle", "user_display": "David Bécu", "version": "0.12.0"}, {"app_id": "manuskript.desktop", "date_created": 1583425735.0, "description": "В целом, очень удобно, вот только после Скривенера немного не привычно, кажется, что чего-то не хватает.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 100, "reported": 0, "review_id": 160312, "score": 0, "summary": "Надеюсь будет развиваться", "user_display": "Maxim", "version": "0.10.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1627149425.0, "description": "Не получается наладить типографские символы", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 40, "reported": 0, "review_id": 402378, "score": 0, "summary": "Чудо басурманское", "user_display": "irina", "version": "0.11.0"}, {"app_id": "io.snapcraft.manuskript-Y4Y1ujdpTlfusos0NnHWAnJTo0yagR56", "date_created": 1641324075.0, "description": "Isnt work in XFCE.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 40, "reported": 0, "review_id": 452077, "score": 0, "summary": "MAk", "user_display": "max", "version": "0.12.0"}]