[{"app_id": "io.snapcraft.gnome-boxes-Gfv04tpaQ9YjeT8nC97GBIyRrXuSdhX1", "date_created": 1654450272.0, "description": "very cool cat on screenshot", "distro": "Ubuntu", "karma_down": 3, "karma_up": 1, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 492885, "score": 0, "summary": "i like cat on the screenshot", "user_display": "evandamafia", "version": "42.0.1"}, {"app_id": "io.snapcraft.gnome-boxes-Gfv04tpaQ9YjeT8nC97GBIyRrXuSdhX1", "date_created": 1701062435.0, "description": "it is a great alternative to virtualbox", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_NZ", "rating": 80, "reported": 0, "review_id": 607823, "score": 0, "summary": "a great lightweight vm manager", "user_display": "bobbit", "version": "44.2"}, {"app_id": "io.snapcraft.gnome-boxes-Gfv04tpaQ9YjeT8nC97GBIyRrXuSdhX1", "date_created": 1710441754.0, "description": "It seems that a lot of people have experienced this same problem as I have.\n\n(I'm using Ubuntu 18.04. - I've NOT upgraded for the very simple reason that I have about thirty or more different applications that I use regularly and they ALL work perfectly. Many of these applications are known to not work on later Versions of Ubuntu.)\n\nOkay. The problem is - You select the operating system you wish to use inside Boxes. (Selecting 'Red Hat' causes an immediate application crash. Selecting other OS's don't have that problem)\n'Boxes' then downloads the chosen operating system before indicating \"Ready to Install\"\nYou click 'Install' and then wait.\nAfter an eternity you see the extremely helpful useful message \"Oops. Something went wrong\". Really helpful and original! The cutting edge of writing code!\nScroll down a little way and you see the cryptic comment \"No KVM\" - whatever that may be?\n\nIf your damned code can detect 'KVM' is not on my system why the hell don't you include a little error trap like - Is KVM present? If 'Yes', skip to next line of code. If 'No', then Install KVM!\" It really is that simple, folks! \nWe see this problem ALL the time in Linux - additional essential dependencies are often omitted from the main application download!\n\nYou code writers may thoroughly enjoy fiddling and tinkering deep in the bowels of a computer. \nSorry, but I don't share your enthusiasm! \nI now use a computer to ACHIEVE various things such as writing text, graphic design, CAD, video editing etc etc etc.\nI do not expect to have to spend my valuable time trying to get YOUR code to work satisfactorily BEFORE I can even begin to work on MY projects.\nThis is not 'FREE Software'! It is extremely 'Time and Labour' EXPENSIVE software!\n\nI then wasted more time with this and did some research. \nI found an answer in a Forum, copied the code into Terminal. Ran the code. something installed itself. Rebooted the computer. Still the same - not working. \nWhat a time wasting load of junk code this application is! \nIt's going to be quicker, easier and cheaper for me to get a few cheap hard drives I can swap about in an old laptop - each with a different operating system. \nThat will achieve exactly what I wish to do without the fuss and stress dealing with this crappy application!\n\nOne of the things I learned very quickly when I was writing Windows Code many years ago. ALWAYS have a clean machine with ONLY the virgin operating system on which to test your latest software. TESTING your software on the same machine that was used to WRITE the code is the biggest cause of application failure by other users. I had a PC that was used ONLY for testing my software. I would Format the hard drive and then load a virgin operating system from a tape drive EACH TIME I did my final testing. (CDs and DVDs were not yet in use at that time.) Doing that ensured that EVERY essential dependency file was included in the installer disks. \n\nRant over!\n\nThanks for reading this far", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 617332, "score": 0, "summary": "Another Half-Baked poorly coded application!", "user_display": "This Is Me", "version": "45.0"}]