[{"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1587056781.0, "description": "Installed it but nothing works. Click Open to open a video and try to subtitle it and nothing happens.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 184401, "score": 0, "summary": "Utterly useless", "user_display": "Mark Rowland", "version": "20.04.03.1607"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1587812650.0, "description": "This doesn't work at all.\nSupported formats are .mp4 and .srt\nBut when you load an .mp4 the application crashes.\nUtter rubbish which should be removed.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 191190, "score": 0, "summary": "Long download and install for nothing", "user_display": "johan", "version": "20.04.19.2326"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1596236267.0, "description": "All the idiots that said this doesn't work, presumably usually consume on YouTube and expected the \"Automatic Subtitles\" that YouTube provides.\n\nTheir exaggerated sense of 'self entitlement' coupled with an attention span of just micro seconds means any software program that needs the slightest amount of effort is, to them, \"Utter Rubbish\"\n\nI'm running Ubuntu 18.04. The program downloaded and launched without any hesitation. \n\nFirst, I selected a video on my computer with an .srt file (Subtitles) and loaded the srt. The program then asked for the appropriate video file - which I then selected.\n\nIn an instant I could play the clips relating to each subtitle. Editing each clip was easy and 'Saving' happened in an instant. (You have to select the icons - I didn't see any text for 'Load' and 'Save'.)\n\nI then loaded a video that did not have subtitles. I had to select the 'MP4' type in order to \"see\" the video for loading. As before, the video loaded in an instant.\n\nBy selecting \"Add\" I created a subtitle text box and typed in the opening spoken lines. The audio waveform is shown on the Timeline at the bottom of the video screen which makes synchronising the start of each subtitle almost \"Lip-Sync\". Dragging the subtitle box on the time line enables precise positioning and also the duration of each subtitle. It is also easy to keep replaying each clip in order to get the exact spoken words.\n\n'Add' creates then next subtitle text box - etc etc.\n\nAfter creating several minutes of subtitles, I saved the subtitle file in the same folder as the video file. (This is essential) The name of the file MUST also be identical to the video file in order for the subs to be recognised.\n\nI then opened the video with VLC and started it playing. I selected the subtitle track from the menu. Sure enough, the subtitles appeared, in sync to the video. Just PERFECT!!\n\nOut of interest, I opened the new .srt file in a text editor. The subtitles simply appear as normal, standard subs. (as expected).\n\nThis really is a great program. It does what it says it does, and is simplicity to operate to produce professional looking subtitles.\n\nI have a few short videos which are not in English. I can now use this program to provide English translation subtitles. Thank you to the software developer for making this very useful program freely available.\n\nIf this software won't open or work on your computer, that is YOUR problem! This software works correctly! Just accept that the fault lies with YOUR computer's configuration or your lack of knowledge. Deal with it. Get over it, and don't keep blaming the software. Doing that, just makes you look stupid!\n\nAny comments appearing below this one, and stating \"It doesn't work\" etc etc, will prove that those people are too lazy to even bother to check other comments and just assume that everything else is always wrong - except THEMSELVES!\n \nThanks for reading this far\n\nThisisi.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 100, "reported": 0, "review_id": 253966, "score": 0, "summary": "Brilliant. It works perfectly. Thank you", "user_display": "Thisisi", "version": "20.07.23.1832"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1598378333.0, "description": "It works.... I *can* make .srt subtitles for .mp4 video and have used this program successfully. If handled with proper caution you'll get where you want to get. But the first problem is that you need proper caution. Otherwise you accidentally press the \"skip till the end\" button and crash the whole program and lose dozens of minutes of work. Happened multiple times. Also you can't just drag 'n drop files without the program crashing. (If you implement this function, why not make sure it actually works?) And when you want to manually select your files using the file open dialog, you have to go through the ENTIRE path each time, beginning at /, which also isn't really ideal. And on top the horizontal scrollbar for the video timeline goes the 'wrong way', intuitively speaking. I really love the concept behind it. And that is what angers me the most. That development on it stopped WAAAAAAAY too early. I as a developer myself would barely consider this a finished product and I deeply hope that we'll get a few juicy updates in near future.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 263197, "score": 0, "summary": "Works, but lost dozens of minutes of work - many times", "user_display": "Isaias Dietz", "version": "20.08.21.0057"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1598534677.0, "description": "Hi! I am Jonatã, the developer of Subtitld.\n\nI see some bad reviews here and, in fact, in other really good software on the store.\n\nUnfortunately, Snap Store does not allow the developer to answer reviews so we could work together to make the software better. I hope Canonical fix that some day.\n\nI really appreciate constructive criticism and really want to improve the software. My tests can not be as wide as the user's. If you read carefully the description, there are various ways to report bugs and even contacting me in a personal way. You can use the issue track (https://gitlab.com/jonata/subtitld), you can use Twitter (https://twitter.com/subtitld), you can join our Discord (https://discord.gg/dpkEGrE), you can email me (subtitld@jonata.org). I really want to help you to use the software.\n\nAlso, the bad reviews here point to bugs that were already fixed some time ago. So please, make sure you are using the latest version, make sure that your Subtitld is updated with the latest released version. You can even install the beta channel with the latest code to check.\n\nAgain, please, don't hesitate in contacting me. And consider the fact that Snap Store lacks some features and reviews are not the best way to report bugs.\n\nThanks for using the software, and for considering this.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 263933, "score": 0, "summary": "Before you post a review, please consider this..", "user_display": "Jonatã Bolzan Loss", "version": "20.08.21.0057"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1614543393.0, "description": "this harshness when people don't give a chance to work for a new produced app even sure without downloading not looking to is very disturbing. I run this app and it's working for me.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 346454, "score": 0, "summary": "some people", "user_display": "denis", "version": "21.02.17.1815"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1618046910.0, "description": "I am a beginner with regard to subtitles. On Ubuntu 20, it crashed at first but I attribute that to my inexperience. I used a short film (made with Openshot) for testing. I added an already created vtt file. I made a captioned video in less than half an hour. \n\nI hope to learn more. Although there are several tutorial videos, it lacks a beginners tutorial for those unfamiliar with subtitles.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 362944, "score": 0, "summary": "I like it", "user_display": "Rose Dlhopolsky", "version": "21.02.17.1815"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1631389952.0, "description": "I tried it and made for more then an hour subtitles to a video that didn't have them. I tried to save to a folder in srt format, but whatever happened it never saved the srt file.\nSo I lost about 2 hours of my time and I don't like that. Therefor I don't like this subtitle creater", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 418995, "score": 0, "summary": "doesn't save", "user_display": "Joop", "version": "21.08.16.1504"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1636489070.0, "description": "It is such a shame that the only thing that doesn't want to work is saving a new srt file. It just doesn't\nEverything else is working great, but it just doesn't want to save. It says it puts in somewhere but it doesn't. Cannot change the location to save to.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 436654, "score": 0, "summary": "Doesn't save", "user_display": "joop", "version": "21.08.16.1504"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1654415812.0, "description": "Tried all the three versions- stable, beta and edge. Two of them crash whereas one version works but cannot save the srt file.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 20, "reported": 0, "review_id": 492768, "score": 0, "summary": "Application crashes", "user_display": "Uttam Kumar Basak", "version": "21.08.25.0110"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1684702253.0, "description": "Does not launch at all on Fedora 38.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 591122, "score": 0, "summary": "Does not launch", "user_display": "Wilbur Jaywright", "version": "23.02.17.0111"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1588774511.0, "description": "Upfront: it requires the mvplayer installed to play the video sound.\nI like very much the way to create subtitles and adapt their length by click and drag, cool! However, it is not working well if you want to have split screens like I do (one side my text, on the other side subtitld. Once you try to resize the subtitld window, everything disappears apart from the video preview window.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 60, "reported": 0, "review_id": 202134, "score": 0, "summary": "I may use it at a later stage", "user_display": "flajeca", "version": "20.05.01.0314"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1596729188.0, "description": "Das Programm startet mit einem dunklen Hintergrund und und unten im Fuß-Bereich sind 2 Buttons \"Open\" und \"Advanced\" Mit Open kann man nach vorhandenen Untertiteln suchen oder nach Videos. Bei der suche nach Videos, die in einem Unterordner von media sind war es schon vorbei, weitere Ordner werden nicht geladen. Einen beenden Knopf, oder Fenster verkleinern gibt es nicht. Einstellungen wie z.B. Sprache oder gar das Aussehen ist nicht möglich.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 20, "reported": 0, "review_id": 256030, "score": 0, "summary": "Unter 18.04 funktioniert es nicht richtig", "user_display": "herweck", "version": "20.07.23.1832"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1606439346.0, "description": "es mala al menos en ubuntu 19, nunca llego a abrir, cada vez que intentaba cargar un SRT se cerraba", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_PE.UTF-8", "rating": 20, "reported": 0, "review_id": 309188, "score": 0, "summary": "Nunca abrio", "user_display": "Fer", "version": "20.08.21.0057"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1624934755.0, "description": "La inferfaz es excelente, para mover los subtitulos sobre la linea de audio con una comodidad y una precisión barbara", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "es_AR", "rating": 100, "reported": 0, "review_id": 393474, "score": 0, "summary": "La mejor interfaz", "user_display": "General", "version": "21.02.17.1815"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1632890615.0, "description": "I am amazed, I never imaged to find such quality in Ubuntu. Great job.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_NI.UTF-8", "rating": 100, "reported": 0, "review_id": 424682, "score": 0, "summary": "I love it", "user_display": "Dev-ni", "version": "21.08.16.1504"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1661955911.0, "description": "Interface minimaliste, pas de menus\nSoit disant intuitive dans le plus pur mac\nplante systématiquement des qu'on ouvre un .txt un .srt qu'a le malheur d'avoir un octet de travers", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 20, "reported": 0, "review_id": 514370, "score": 0, "summary": "a fuir", "user_display": "marechal", "version": "21.08.16.1504"}, {"app_id": "io.snapcraft.subtitld-dtZdc8NjWkQ6VUVb1aR2oGczaKblwVvN", "date_created": 1699440095.0, "description": "Une interface un peu complexe, mais de nombreuses fonctionnalités intérressantes avec notamment l'extraction du sous-titre d'une vidéo avec une possibilité de traduction automatique.", "distro": "Linux Mint", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 80, "reported": 0, "review_id": 606138, "score": 0, "summary": "Une très bonne application pour travailler les sous-titres", "user_display": "luc", "version": "23.02.17.0111"}]