[{"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1721497731.0, "description": "I could not save the circuits as the save window shows only some squres No font", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 40, "reported": 0, "review_id": 628001, "score": 41, "summary": "No font in Save Window", "user_display": "Thuvalpakshi", "version": "1.3.3"}, {"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1693019494.0, "description": "I keep getting the \"Linux Warning\" message at start up and I follow the instructions, copy the command line and pasting it into the terminal, replacing [username] with my username, but to no avail. I get the \"No serial ports interface slots\" error. I try the \"sudo snap set system experimental.hotplug=true && sudo systemctl restart snapd\" command to ix it, but it seems to have no effect, the first command still returns the \"No serial ports interface slots\" error. Not sure if the program is broken or if the Snap software is broken. Either way, it's a problem.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 599940, "score": 0, "summary": "\"Linux Warning\" issue unresolvable", "user_display": "JTC", "version": "1.1.2"}, {"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1700171532.0, "description": "I saw a reference to this application on YouTube. \nI went to the website and had a look at it. It seemed very promising.\nI went to 'Downloads' and my ONLY option was \"PAY and Download\".\nClicking there took me straight to PayPal.\n\nMy experience with Linux is such that many software developers expect us to do half the work! How many times do we see \"If the software doesn't open, Go to Terminal and type in ~~~~~~~~~!\n\nI'm not going to pay up front for software that I cannot even be certain will install without a degree in computer science.! - I left the web site!\n\nThen, surprise, surprise, I find the software is listed on the Ubuntu store.\nOkay. Lets try it here.\nIt installs okay.\nI run it.\nI get a black screen with nothing on it except the top menu\nI press a few menu items.\nI get a screen of what looks like 'placeholder code.\nThat is all! Nothing else appears!\nI try to terminate the application.\nNo response.\nThe ONLY way to terminate (apart from re-booting) is to open System Manager and REPEATEDLY (several times) kill every mention of Cirkit Designer!\n\nThe Ubuntu Store lists this application as \"Propriety\" - meaning it's not Free!\nMy guess is that perhaps it didn't work because I didn't find out how to pay . . . BEFORE I try it out???? ha ha! sorry. That won't happen.If I can use it successfully I'd be happy to pay.\n\nI'm using Ubuntu 18.04 LTS.\nThere is no mention anywhere of which release of Ubuntu will run the application.\nI have some SIXTY or so applications loaded - all working perfectly.\nI am NOT going to upgrade to a more recent offering of Ubuntu, only to find that probably more than half of the applications I regularly use now fail to work.\nEverything works correctly at present.\n\nTinkering and fiddling with Ubuntu and Terminal etc. is most certainly NOT a hobby of mine.\n\nWhile we are all cursed with software providers offering software as a 'kit of parts', Linux will NEVER gain traction over Microsoft and Mac. \nTheir software works straight out of the box and is NOT a 'Kit of Parts' which may or may not work, or needs lines of instructions in Terminal just to make it run.\n\nThere are some very good Linux software coders whose applications indeed do run 'straight out of the box'. Unfortunately there are also too many 'amateur enthusiasts' who enjoy tinkering and fiddling, putting out software which either is very shaky or needs a lot of additional work by the user to get it to even run!\n\nSorry for the long Rant! I'm just getting rather tired of having to spend more time attempting to make some software even run, than actually using it for its purpose!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 40, "reported": 0, "review_id": 606884, "score": 0, "summary": "Looks promising but appears to be behind a paywall", "user_display": "ThisAmI", "version": "1.1.2"}, {"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1702612774.0, "description": "Does what it says. \nRight click icon - New Window\nAllow setting change - yes\nOpen new file, tutorial, 5-minute helper all there.\nAll modules addons sensors available from Adafruit, all boards available to connect, diagrams like out of the book.\n\nUbuntu 23.04", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 609349, "score": 0, "summary": "Works excellent", "user_display": "Home-Office", "version": "1.1.2"}, {"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1706431424.0, "description": "Looks promising BUT doesn't see usb port", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 20, "reported": 0, "review_id": 613128, "score": 0, "summary": "Looks promising BUT doesn't see usb port", "user_display": "moohcow", "version": "1.2.0"}, {"app_id": "io.snapcraft.cirkit-designer-JKPCksIMpj8JQD09wTE7HwAxq0QV9fhB", "date_created": 1641897322.0, "description": "cirkit-designer startet nicht", "distro": "Ubuntu", "karma_down": 6, "karma_up": 8, "locale": "de_AT.UTF-8", "rating": 20, "reported": 0, "review_id": 453707, "score": 2, "summary": "startet nicht", "user_display": "mcp", "version": "1.0.1"}]