[{"app_id": "io.snapcraft.dakanji-Hd1p45RzjKJKAWYHQOukPXEGD8El4dlP", "date_created": 1717481648.0, "description": "I usually don't write reviews, but this application? It is fantastic. The beautiful CSS, the fantastic app design, the clean transitions- all of it is fantastic. I am a Japanese learner, and I have just spent the past 20m marveling with my mouth agape at how cleanly this is put together. Furthermore, I am completely shocked that this isn't being talked about more. This deserves publicity, especially with all of the SUBTLE perfections that make it all the better. Like the matrix-style auto-cascading words? Those are beautiful in themselves. But the fact that you can CLICK on them and READ the definition thereafter? Absolutely magnificent. And don't even get me started on the dictionary integration. Agh, I was randomly downloading applications with the \"Japanese\" keyword on here, but I have come across a god***n gem. I have taken the liberty of installing this on my phone just now too. Anyways: Developer, whoever you are, I hope you know that you have made my day, maybe my week, quite possibly my month, and dare I say my year. From the bottom of my heart, thank you for developing this fantastic application. I would write more, but I need to get back to using it. Cheers ;)", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 624085, "score": 33, "summary": "Best. Just the best", "user_display": "niftion", "version": "3.4.0"}, {"app_id": "io.snapcraft.dakanji-Hd1p45RzjKJKAWYHQOukPXEGD8El4dlP", "date_created": 1710156271.0, "description": "I'm just starting to use it, but I can search words in the dictionary using romaji which I could not with Kiten, also tried the text function to put spaces and furigana and it works really well, this is great!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 1, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 617063, "score": 10, "summary": "Starting off great!", "user_display": "Alejandro", "version": "3.3.3"}]