[{"app_id": "io.snapcraft.paradrop-voice-z72SgNRpzQGQ7UVNf7D2yNBbatdEcIVL", "date_created": 1599412244.0, "description": "I Downloaded this using a MicrosoftSurface2 Pro Tablet about 2weeks before posting this review.. Reasons being that at the time I was randomly downloading software dealing with transcribing phone conversations or recordings into text.. \nI never opened this app since I did find something to fit my needs but after a few days I started to notice my machine was running sluggishly slow and that the fans on the computer where turning on 5 to 10min after boot even without having to open any applications and when I did open something the fans on the computer would get violently loud like I was running some benchmark software and at times it would get too hot that it would just immediately go off.. \nI installed Stacer and rebooted the computer... When I opened the Stacer program on their home screen the first dial showed that my cpu was running at 100% non stop. I went down to the processeses tab, ticked on \"All Processes\" checkbox.. And this Paradrop-Voice was the catalyst taking away all my computers resources. After I uninstalled it all the issues it was having have stopped. \nThing that I noticed on All Linux Software Download stores is that they don't put a section where developers can post compatibility specs so I don't know why it was causing my computer to malfunction.. \nI am just posting this to warn people to be-careful downloading this as it can seriously break your computer and to also be-careful downloading any software that is not showing screenshots of their software running or software lacking legitimacy and reputation since reviews here are somewhat lacking..", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 268118, "score": 0, "summary": "Downloaders Beware", "user_display": "chri5t", "version": "0.1"}, {"app_id": "io.snapcraft.paradrop-voice-z72SgNRpzQGQ7UVNf7D2yNBbatdEcIVL", "date_created": 1589054014.0, "description": "gracias por probar", "distro": "Ubuntu", "karma_down": 0, "karma_up": 14, "locale": "es_ES", "rating": 40, "reported": 0, "review_id": 204918, "score": 48, "summary": "no me fonciona", "user_display": "Butty", "version": "0.1"}]