[{"app_id": "io.snapcraft.thedesk-eCfQyz3EUGkkYRYbkfgZ08LIXnTIqLFZ", "date_created": 1592143352.0, "description": "TheDesk is a good Mastodon client that supports multiple accounts. It has a clean layout with options for multiple columns. One unique feature is the Nano option, a simple and minimalist approach to post a toot without any distraction.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 230464, "score": 0, "summary": "Good Mastodon Client", "user_display": "Quen-Quen Potter", "version": "20.1.2"}, {"app_id": "io.snapcraft.thedesk-eCfQyz3EUGkkYRYbkfgZ08LIXnTIqLFZ", "date_created": 1590699743.0, "description": "I don't want to make fun of people whose English is not very good, because of course my Japanese is much worse than the English of the person who translated the user interface -- but I was not able to figure out how to set the client up, and it did not help that many of the English sentences in the UI were either incomplete or unclear, and that most other bits of text were Japanese, including the error messages that kept popping up, presumably to let me know what I was doing wrong.\n\nI very much hope that somebody can help out with better and clearer translations, and that I can try again in the not to far future... Maybe even with native packages for some distributions? I had to install and set up Snap just in order for this failed attempt, and using Snap on KDE is ... not comfortable.", "distro": "openSUSE Tumbleweed", "karma_down": 0, "karma_up": 1, "locale": "de_DE", "rating": 40, "reported": 0, "review_id": 219369, "score": 0, "summary": "Looks very good on paper, but only if you speak Japanese", "user_display": "Sascha", "version": "20.1.2"}, {"app_id": "io.snapcraft.thedesk-eCfQyz3EUGkkYRYbkfgZ08LIXnTIqLFZ", "date_created": 1637403907.0, "description": "Permet de visualiser tous les comptes sur un même écran par une vue par colonne.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 60, "reported": 0, "review_id": 439960, "score": 0, "summary": "Plutôt pas mal", "user_display": "Urustu", "version": "22.1.1"}]