[{"app_id": "io.snapcraft.xibo-player-49j19QBkjBGJYVpX2fRfGgte8BIWrhby", "date_created": 1605820196.0, "description": "This system works well for many of those Graphic Sign elements that you want to broadcast. But not everything is supported under every platform, so your forced to choose one player. In Windows, you can have transittions between layouts, but not in Linux. Other things to note.\n\nIt promotes that it displays webpages, just not all webpages, because some(many) won't allow themselves to be embedded in the frame. This can be very limiting.\n\nPowerPoint has to be available on the player to display .pptx files, PowerPoint Viewer isn't enough, so WebOS, Tizen, Android, Linux Systems are out of luck. Nope, LibreOffice can't assist because it wont work as a Chrome add-on. Converting to a Pdf works very well, but the animations disappear in the process. \n\nRTMP, HLS, and Dash streaming from OBS are available for certian platforms as well...but not Linux, which is what I originally wanted to use. That player is still being developed. Linux Video playback worked well initially about 8 months ago but about 5 August 2020 mysteriouslly stopped working.\n\nThe Weather service Dark Sky module stopped working after Apple bought it, and a new service hasn't really stepped in to support this in the same way.\nFinally as was projected, Flash is deadso thats one more graphic element that can no longer be used to display.\n\nThe Android system is also under further dvelopment. With some promice for those running Android for PC. In fact there is still development ongoing for this system, but lack of funding and services being limited in other areas has really hampered the growth of what this Project could really be.\n\nI like this system, have a need for it, and want to love it... there are just a few things that originally caught my eye, that turned out to be less than offered.", "distro": "CentOS Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 305820, "score": 0, "summary": "Love the concept and implementation...but..", "user_display": "player", "version": "1.8"}, {"app_id": "io.snapcraft.xibo-player-49j19QBkjBGJYVpX2fRfGgte8BIWrhby", "date_created": 1631190345.0, "description": "hello my friends", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 418253, "score": 0, "summary": "great app", "user_display": "Gimmick02", "version": "1.8"}]