[{"app_id": "io.snapcraft.knetwalk-R9hOCSoK9K1rl2Ax75EksdtYChFhc7NV", "date_created": 1623697495.0, "description": "Nice change from playing solitaire.", "distro": "Zorin OS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 388714, "score": 0, "summary": "Fun game!", "user_display": "Moejj O'Raisin", "version": "3.3.21040"}, {"app_id": "io.snapcraft.knetwalk-R9hOCSoK9K1rl2Ax75EksdtYChFhc7NV", "date_created": 1580598070.0, "description": "Das Spiel ist ästhetisch ein Genuss, trotz seiner Einfachheit. Und man kann wunderbar dabei entspannen, auch wenn manche Konstellationen wirklich knifflig sind. Man kann im einfachen Modus beginnen. Der ist auch voreingestellt. Und wenn man nicht weiter weiß, kann man sich die Lösung zeigen lassen. Links-Klick dreht die Teile gegen den Uhrzeigersinn, Rechts-Klick dreht sie im Uhrzeigersinn. Ich beginne immer außen, deswegen mag ich den sehr schweren Modus nicht, wo man keine Außenbegrenzung hat (man muss sich vorstellen, dass die Leitungen auf der gegenüberliegenden Seite weiterlaufen). \n\nDie Erdkugel im Hintergrund schafft eine angenehme Atmosphäre, so dass ich beim Klicken fast ein wenig in einen Flow gerate. Vielleicht kennt Ihr diese Spiele, bei denen man eine Wasserleitung zusammenbauen muss? Da hat mich immer gestört, dass man so unter Zeitdruck steht und dann das Wasser an den undichten Stellen ausläuft. Bei diesem Spiel hier kann man immer so lange spielen, bis man die Lösung gefunden hat. Man kommt halt nicht in die Besten-Liste, wenn man zu lange braucht oder zuviel ändert. Das ist auch schon alles...", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 100, "reported": 0, "review_id": 145395, "score": 0, "summary": "sehr schön gemacht und nie langweilig", "user_display": "Dorith", "version": "19.08.0"}, {"app_id": "io.snapcraft.knetwalk-R9hOCSoK9K1rl2Ax75EksdtYChFhc7NV", "date_created": 1586024709.0, "description": "Instale, y no inicia.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_AR", "rating": 20, "reported": 0, "review_id": 176466, "score": 0, "summary": "No funciona", "user_display": "Saymanhaa", "version": "19.08.0"}]