[{"app_id": "io.snapcraft.rewording-fukbn5Bv8fbanE7H1jrLJ9BmQlY9Rz3K", "date_created": 1662024742.0, "description": "like this app it is very usefull app", "distro": "Ubuntu", "karma_down": 3, "karma_up": 3, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 514818, "score": 0, "summary": "Great App", "user_display": "Enzipe", "version": "1.0.2"}, {"app_id": "io.snapcraft.rewording-fukbn5Bv8fbanE7H1jrLJ9BmQlY9Rz3K", "date_created": 1710512976.0, "description": "If you are writing a novel and need to create dialogue spoken by someone with little knowledge of English, this could be an easy and useful tool. For a native English speaker I see no real advantage at all.\n\nHowever, if English is not your first language and you are still learning, this might actually help you.\n\nThe changed words are coloured and clicking on those will reveal a box showing the original word and also the suggested alternatives. There is also the option of adding a word your own choice, not suggested by the application.\n\nI first tried this application on a couple of paragraphs of text copied from the net. Rather than improve the 'readability' it actually made it worse. \n\nI then Copied in part of the text description of this particular program. Unfortunately sometimes the context of a sentence is misunderstood by the software. \n\nFor example :- the original -> \"Since our app integrates with cloud storage, you don’t have to worry about having your files saved on your device. Here are the steps that you need to follow to use this rewording app:\" \n\nBecomes :- \"Since our app integrates with cloud storage, you don’t must fear approximately having your documents stored in your tool. Here are the stairs which you want to observe to apply this rewording app:\"\n\nI think the author had already chosen the best and correct wording in his description and this application simply butchered it.\n\nOf course, you do have the ability to alter and change the unsuitable words but this is a very tedious approach. \n\nIt might be better to be able to click on words in the original text and then have a 'box' of alternatives offered to you. - a little like a 'spellchecker', but as a thesaurus.\n\nAdditionally, I could find no way to Copy the results straight off the application screen. It has to be Saved as a PDF first - which is then opened. This becomes tedious.\n\nTo be truthful, the use of a Thesaurus - either online or paper based would be probably quicker and more effective.\n\nThanks for reading this far.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 617399, "score": 0, "summary": "Not a realistic or grammatically correct rendering", "user_display": "This Is Me", "version": "1.0.2"}, {"app_id": "io.snapcraft.rewording-fukbn5Bv8fbanE7H1jrLJ9BmQlY9Rz3K", "date_created": 1674165041.0, "description": "Unable to load asset: assets/languages/ru.json", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 40, "reported": 0, "review_id": 557096, "score": 0, "summary": "Error while start application", "user_display": "klunker", "version": "1.0.2"}]