[{"app_id": "muse.desktop", "date_created": 1546118752.0, "description": "Worst program ever. it looked so promising, but I lost two days in boiling anger and frustration trying to make this work. Wouldn't recommend to my worst enemy. I couldn't get any sound or functionality out of it. The manual is totally unhelpful, poorly written, and doesn't answer any basic questions. The manual is in fact as useless as the program. There is no help to be found ANYWHERE, unless you feel like getting on an automated mailing list and hoping that somehow they will mail you exactly what you need. I searched for hours on the net looking for answers, and I am still stunned at the lack of helpful information. Apparently the forum that used to exist suffered the same fate as the program - and is incurable. Seriously, why is this program even on the list? It's a suicide hazard.", "distro": "Fedora", "karma_down": 3, "karma_up": 16, "locale": "en_US", "rating": 20, "reported": 1, "review_id": 12805, "score": 0, "summary": "A headache without a trace of useful information to troubleshoot", "user_display": "Austin", "version": "3.0.2"}, {"app_id": "muse.desktop", "date_created": 1564879827.0, "description": "I had to \"Force Quit\" this program. The user interface is extremely slow, the program always greets me with errors about MIDI timing problems (my computer has proper specs, is an Intel i7 with 16 GBs of RAM, and a SSD drive that can run everything else quickly without any slowdowns at all), and when I try to click on anything, including menus, nothing happens.\n\nThis program is useless to me for music composition, so I'm uninstalling it.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA", "rating": 20, "reported": 0, "review_id": 67879, "score": 0, "summary": "Program is unresponsive", "user_display": "Randolf Richardson", "version": "2.1.2"}, {"app_id": "muse.desktop", "date_created": 1557367679.0, "description": "Bester MIDI-Editor für mich, ist aber noch ausbaufähig.", "distro": "Ubuntu", "karma_down": 1, "karma_up": 0, "locale": "de_AT", "rating": 80, "reported": 0, "review_id": 31226, "score": 0, "summary": "Audio-Editor mit Schwerpunkt MIDI", "user_display": "horchzwerg", "version": "3.0.2"}, {"app_id": "muse.desktop", "date_created": 1574609479.0, "description": "No es fácil simplemente abrir el programa y empezar a añadir sonidos. Dónde están los editores?", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "es_ES", "rating": 20, "reported": 0, "review_id": 115074, "score": 0, "summary": "Complicado", "user_display": "Alfredo León", "version": "2.1.2"}]