[{"app_id": "org.kde.plasma.wacomtablet", "date_created": 1662219812.0, "description": "I haven't used many features provided with these settings, but it has very useful touch mapping option. It's annoying that calibration does not fully calibrate touchscreen, but changing numbers manually after that gets the job done. It even becomes (slightly) more accurate than in Windows! I haven't seen similar programs in other desktop environments with these features for touch, so it's literally the reason why I use KDE on my laptop in the first place. KDE neon, 20.04, Lenovo ThinkPad X200T", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 80, "reported": 0, "review_id": 515975, "score": 14, "summary": "Works good on my 2-in-1 PC", "user_display": "actdye", "version": "3.2.0-3"}, {"app_id": "org.kde.plasma.wacomtablet", "date_created": 1560868056.0, "description": "finally found the one that actually works and adds the wacom app", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 49043, "score": 0, "summary": "It works", "user_display": "Dmitriy", "version": "3.1.1-0xneon"}, {"app_id": "org.kde.plasma.wacomtablet", "date_created": 1582738377.0, "description": "... I don't use any other distro than KDE neon. (I tried to install it on some other distro with KDE but it didn't work. Maybe/hopefully this has changed by now though. But it's something you can try if you have difficulty getting this to work.)\n\nAnyway, I rely heavily on wacom tablets and this is the only thing I found that lets me configure them extensively.", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "C", "rating": 100, "reported": 0, "review_id": 156772, "score": 0, "summary": "THE tool because of which..", "user_display": "Live session user", "version": "3.2.0-0xneon"}, {"app_id": "org.kde.plasma.wacomtablet", "date_created": 1609602996.0, "description": "So frustrating, makes me want to go back to windows. Partially detacts and works when it wants to. Some detects \"touch\", but yet doesnt actually work when switching buttons off and on. Krita totally doesn seem to detect Wacom Intous Pro. I thought the Krita devs had this covered.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_ZA", "rating": 20, "reported": 0, "review_id": 323331, "score": 0, "summary": "Doesnt Work!!", "user_display": "Rob", "version": "3.2.0-3build1"}, {"app_id": "org.kde.plasma.wacomtablet", "date_created": 1631230833.0, "description": "KDE tablet support is abyssmal, and this does nothing, but make it worse. I have an HP EliteBook 810. The screen rotation doesn't work. You have to manually alter the screen direction. Once you do that, the mouse control stays oriented as though the screen isn't rotated. Wanna touch to slide onto the next page, or touch an icon to start a program...? Not with this junk. \n\nHowever, it will successfully freeze your unit, until a hard, manual power down. Kudos for that!\n\nGotta switch between this and Gnome just to be able to read a darn book. Gnome works.... (barely) for tablet PCs. Although, I m NEVER going back to Windoze, this is almost enough to make a less-determined person give up.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 418416, "score": 0, "summary": "JUNK", "user_display": "W.T.C.M.", "version": "3.2.0-3build1"}]