[{"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1668084439.0, "description": "not even starting", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 537727, "score": 0, "summary": "not working ubuntu 22.10", "user_display": "Andrei", "version": "0.F"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1678658901.0, "description": "Gets an error:\n Error while initializing the interface: Cannot load font data/font/Terminus.ttf", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 20, "reported": 0, "review_id": 572325, "score": 0, "summary": "The tileset version won't start, cursor version works though", "user_display": "kev", "version": "0.F"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1687575250.0, "description": "would be nice if the new stable was updated other then that thanks for the add to the repo", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 594669, "score": 0, "summary": "new stable when?", "user_display": "pi", "version": "0.F"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1693140443.0, "description": "CDDA is a very deep and complicated game, and you are thrown into it with very little information or opportunity for official spoilers. You will have to learn from experience (or vicariously on YouTube via Let's Plays and tutorials), but that just makes everything you finally achieve so much more exciting. Beginners should feel free to choose settings which make the game easier. There is no wrong way to play if you are having fun.\n\nI was pleased to see Cataclysm: Dark Days Ahead finally listed in the repository for Ubuntu when I moved to 22.04. I think this is great! Not that installation is difficult. CDDA is an entirely open source project, free in all ways, with a very active modding community and often more than daily experimental updates, and installation and playing is as simple as downloading, unpacking, changing a terminal directory to the one containing the game, and running it in the terminal. (You can drag and drop a folder to your terminal window after typing \"cd\" to change to that directory--no need to type the entire path name--and similarly for executing a file itself by name, so there is no need to worry about where your installation is located.)\n\nCDDA is one of the best games of all time, rivaling Dwarf Fortress for the amount of attention to detail that is given to the game and the care of the developers, and having CDDA in the most widely used Linux repository will make it much more accessible to people who might not have heard of it before.\n\nI am a bit disappointed that 0.G is not the stable version available at the time of this review, six months after its release. It has two years of content on 0.F and is a much better game.\n\nOne other thing I would take issue with is the \"proprietary code\" caution. CDDA is open source, entirely, and free to use in any manner. The source code is available on GitHub. Obviously if you decide to play the daily experimental releases there will not have been much time for code review.\n\nfrom their contribution guidelines page:\n\n > Cataclysm: Dark Days Ahead is released under the\n > Creative Commons Attribution ShareAlike 3.0 license.\n > The code and content of the game is free to use,\n > modify, and redistribute for any purpose whatsoever.\n > See https://creativecommons.org/licenses/by-sa/3.0/\n > for details. This means any contribution you make to\n > the project will also be covered by the same license,\n > and this license is irrevocable.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 600047, "score": 0, "summary": "One of the top games of all time", "user_display": "Marc Drexler", "version": "0.F"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1702088408.0, "description": "While the game lacks AAA graphics and the controls take a while to learn, the game delivers one of the best zombie horror simulators I have ever played. A poor man's project zomboid that delves deeper into the occult and scifi fantasy than a typical zombie shooter. If you don't like that, mod it out. There are a plethora of settings, graphic and world mods that will take your game into everything from dinosaurs to magical wonderment.\n\nThe vanilla game sports character customization, vehicles, exploration, combat, mutations, hordes of zombies, and unforgiving combat that will send your character running for the hills to hide in the deepest and most inpenetrable bunkers, only to die of exacerbated flu symptoms because you didn't account for the cold.\n\nNo one playthru will resemble another, especially if you play on different world seeds and settings. In one game, you will be overrun by a zombie horde, in another, you will be captured and killed by Mi-Go, or you will embrace the Marloss and eat what good mushrooms crave.\n\nThere are so many ways to play the game, and so many directions to go, like super mega mobile vehicle fortresses, or change yourself into a super mutant and evolve into a beast monster capable of cutting through hordes of zombies without breaking a sweat, you won't get bored because replayability is what sells this game.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 608787, "score": 0, "summary": "Cult Classic, Best Rogue-like zombie survival, ever", "user_display": "stuart", "version": "0.G"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1709237745.0, "description": "I recently took a chance on this game and found it to be rewarding in several ways.\n\nThe randomness creates a new story each time with subtle detail and depth that most other games throw in your face.\n\nA nice dose of learning, exploration, systems, and story await!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA", "rating": 100, "reported": 0, "review_id": 615989, "score": 0, "summary": "Rich & Rewarding", "user_display": "Manfredi", "version": "0.G-4"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1722536870.0, "description": "L'interface texte est du genre du début des années 1980. Si on fait l'effort de s'y contraindre, le jeu peut devenir intéressant. Version \"0.F-3\" (OS Kubuntu 22.04).", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 80, "reported": 0, "review_id": 628912, "score": 41, "summary": "Interface texte genre années 1980", "user_display": "septcent", "version": "0.F-3-3"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1716886309.0, "description": "Самая проработанная игра про апокалипсис в которую я играл", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU", "rating": 100, "reported": 0, "review_id": 623572, "score": 24, "summary": "Супер!", "user_display": "temaster", "version": "0.G-4"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1657013107.0, "description": "Лучший roguelike который я видел в репозитории debian", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "ru_RU", "rating": 100, "reported": 0, "review_id": 500566, "score": 0, "summary": "Круто!", "user_display": "Sergey", "version": "0.F-3-4"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1666299185.0, "description": "it's game super mega COOL", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU.UTF-8", "rating": 100, "reported": 0, "review_id": 530779, "score": 0, "summary": "fun zombie-survival game", "user_display": "kenshi", "version": "0.F"}, {"app_id": "org.cataclysmdda.CataclysmDDA", "date_created": 1651295378.0, "description": "gooooooooooooood game", "distro": "Ubuntu", "karma_down": 3, "karma_up": 9, "locale": "zh_CN.UTF-8", "rating": 100, "reported": 1, "review_id": 482702, "score": 16, "summary": "gooooooooooooood game", "user_display": "useradmin", "version": "0.F"}]