[{"app_id": "org.learningequality.Kolibri", "date_created": 1586155541.0, "description": "Fast forward to year 2023: the pandemic has taken its toll. The state of the planet has been dramatically altered. Humanity has reset. The power grid is irreparable, with small pockets of civilization having just enough juice to maintain basic infrastructure. The internet is dead and all books are, well... still there, but regardless, nobody likes a textbook. How are we to learn anything? How are we to educate our younger generations? With this app, you can.\n\nEssentially, this is an educational content delivery system. You download the app, and it allows you to import a variety of content for offline access and host it over a local network. Imagine being able to deliver the curricula of an entire K-12+ school system from your computer, without the need to access the internet. Thats what this does, and even better: in just a few clicks. The interface is fairly simple: a webpage set to localhost with what appears to be a nodejs backend. No confusing install or setup required, you just create your profile (whether you be a home computer, educational facility, etc) and you select from a variety of channels to import (meaning download to your device) for hosting to your network. I downloaded it for personal development use and it works great for that also, being that you can download extensive libraries of educational content in a very easy, streamlined way.\n\nThe available content runs the gamut, with a few areas I'd like to see more of: MIT opencourseware would be great, and more computer science content. Overall this application is impressive, and a testament to how far we've come. A decade ago, similar proprietary applications like this would have cost school systems millions of dollars... maybe they still do, I don't know. But that this exists now, and is free to use, is a testament to the good will of humanity. It exceeds the expectations of its primary use case, which is promulgating equality of education and allowing people in impoverished or underdeveloped places to access a learning environment that would otherwise require internet access. Despite beginning this review in jest, we currently live in a time where can't ignore the value of such a thing, even as privileged first-worlders.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 177411, "score": 0, "summary": "Invaluable tool, even for personal use", "user_display": null, "version": "0.12.8.1"}, {"app_id": "org.learningequality.Kolibri", "date_created": 1636647243.0, "description": "The version that I am using already has content available and I do not have to download it.", "distro": "Endless", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 437296, "score": 0, "summary": "Great content", "user_display": "Byron", "version": "1.0"}, {"app_id": "org.learningequality.Kolibri", "date_created": 1677916769.0, "description": "Great offline learning resource for everyone.", "distro": "SteamOS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 569739, "score": 0, "summary": "Great Resource", "user_display": "A. Pham Steam Deck User", "version": "2.2.0"}, {"app_id": "org.learningequality.Kolibri", "date_created": 1707024384.0, "description": "Good educational content.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 613686, "score": 0, "summary": "Highly recommended for childrens", "user_display": "Shresth Kumar Lal", "version": "2.3.4"}, {"app_id": "org.learningequality.Kolibri", "date_created": 1585884070.0, "description": "Es una excelente manera de combatir el aburrimiento de la cuarentena por el corona virus adquiriendo conocimientos gratuitos y de calidad", "distro": "Ubuntu", "karma_down": 4, "karma_up": 33, "locale": "es_AR.UTF-8", "rating": 100, "reported": 0, "review_id": 175485, "score": 25, "summary": "Eficiente Gratis", "user_display": "juan", "version": "0.12.8.1"}, {"app_id": "org.learningequality.Kolibri", "date_created": 1682467013.0, "description": "el curso de matematicas en español buenisimo de khan academy. muy didactico", "distro": "Zorin OS", "karma_down": 0, "karma_up": 0, "locale": "es_CL", "rating": 100, "reported": 0, "review_id": 584211, "score": 0, "summary": "el curso de matematicas en español buenisimo de khan academy", "user_display": "Luis Beltrán", "version": "2.2.1"}]