[{"app_id": "org.kde.arianna", "date_created": 1681500964.0, "description": "Great app! Worked out of the box. It even detected by books automatically from the downloads folder. everything seem to work. \nOnly two basic options I would like to see later - \n1. When a book is open there is no option to change the available settings. Thus, a simple hamburger menu beside the search bar would be appreciated.\n2. I am not sure what is the default folder for offline library. An option to change the default folder would be much appreciated.", "distro": "TUXEDO OS", "karma_down": 5, "karma_up": 10, "locale": "en_IN", "rating": 100, "reported": 0, "review_id": 580920, "score": 11, "summary": "App I have been waiting for", "user_display": "Arjun Menaria", "version": "1.0.0"}, {"app_id": "org.kde.arianna", "date_created": 1682278236.0, "description": "when you start the flahub Ariana app it crashes immeiatley after launch. Too bad....", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 583428, "score": 0, "summary": "This package craches immediatley", "user_display": "tangarora", "version": "1.0.0"}, {"app_id": "org.kde.arianna", "date_created": 1682365249.0, "description": "If I wanted to support globalist propaganda I would download the load of garbage you included in the program install. Including a copy of \"1984\" would be more appropriate.", "distro": "PureOS", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 80, "reported": 0, "review_id": 583830, "score": 0, "summary": "Looks good but leave out the free ebook", "user_display": "purism", "version": "1.0.0"}, {"app_id": "org.kde.arianna", "date_created": 1682589172.0, "description": "I have tried to install this and it just will not start up. Says that it installs but when you try to start it up all I get is a bouncing icon on the screen and after that nothing. Have tried to start this on X11 and Wayland but it just won't go.", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 584598, "score": 0, "summary": "Will not start", "user_display": "darryl", "version": "1.0.1-0xneon"}, {"app_id": "org.kde.arianna", "date_created": 1684457903.0, "description": "Well, the title would be longer if I could but that's it, for those who the program doesn't open just install the flatpak version and that's it. This is \"fixed\" because the flatpak version comes with all its dependencies, and at least in my case the Ubuntu repositories version is missing two dependencies: \"kirigami. addons\" and \"QtWebChannel\", the first one is easily installable using Synaptic and the second one simply does not exist, I looked for it with all possible names and installed several meta packages with that name and it still does not open, and now I have about 20 meta packages that I did not need flooding my system and I can not uninstall because it breaks programs like Kalendar...\n\nThat aside, the program works fine, many thanks to the developers and the interface is beautiful. \n\nI hope the dev reads this because without a KDE account I can't comment on the program's Issues, but I'm not sure if it's a bug or what but the program does NOT remember the last book position when exiting and re-entering. I have to manually note which was the last page (which it doesn't say either, it just gives a percentage at the bottom).\n\nI also want to report that there is some inresponsiveness when changing the page using the bottom bar, and when resizing the window, since the content is deformed and you have to reopen it to correct.\n\nI know it's only version 1.0.1 but please fix those things, I know that the dependencies problem is not the dev's fault, but please add an bookmark option, it's stressful to have to manually go to the last position.", "distro": "KDE neon", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 60, "reported": 0, "review_id": 590416, "score": 0, "summary": "For those who have problems with the app not opening, install flatpak", "user_display": "Tryz", "version": "1.0.0"}, {"app_id": "org.kde.arianna", "date_created": 1689927726.0, "description": "Nice simple epub reader. Integrates nicely with Plasma", "distro": "SteamOS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 597026, "score": 0, "summary": "simple epub reader", "user_display": "Steam Deck User", "version": "1.1.0"}, {"app_id": "org.kde.arianna", "date_created": 1707732637.0, "description": "it crashed when I tried to open an epub file", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 20, "reported": 0, "review_id": 614388, "score": 0, "summary": "it doesnt work", "user_display": "rodrigo", "version": "23.08.3"}, {"app_id": "org.kde.arianna.desktop", "date_created": 1682278865.0, "description": "It refuses to start after install... is ot in the path... and no icon in the launch menu... please remove, correct problems, and re-publish", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 583431, "score": 0, "summary": "Applicationa does not launch", "user_display": "tangarora", "version": "1.0.0"}, {"app_id": "org.kde.arianna", "date_created": 1684290702.0, "description": "Flawless, recognice my collection without any config", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "es_CL.UTF-8", "rating": 80, "reported": 0, "review_id": 589971, "score": 0, "summary": "Works", "user_display": "Pablo Fuerte", "version": "1.0.0"}]