[{"app_id": "org.kde.kphotoalbum.desktop", "date_created": 1556795880.0, "description": "It takes forever to scan every. single. image so that it can find out information on everything in my pictures folder. I have over 3,000 photos but it wants to take 15 seconds on each one? I'm good.", "distro": "Ubuntu", "karma_down": 1, "karma_up": 2, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 28187, "score": 0, "summary": "I never got to really use it..", "user_display": "Jayphace", "version": "5.3"}, {"app_id": "org.kde.kphotoalbum.desktop", "date_created": 1608496957.0, "description": "I was looking for a tool that would allow me to tag and use those tags. Only that. I didn't want the tool to modify my images in any one. This is a tool that does it and does it well. Very happy so far.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 318654, "score": 0, "summary": "Very nice for tagging and searching. Well designed", "user_display": "Stan Berka", "version": "5.3"}, {"app_id": "org.kde.kphotoalbum", "date_created": 1590403932.0, "description": "program may be usable to people who dont have any videos, that is if you manage to get around its quirks, but if you have videos, each time program starts it starts to use ffdshow codec for \"scanning video thumbnails\" and does so in manner that you cant even move your mouse because it uses all available resources. there is no option to disable that behaviour and i even suspect it may be using your cpu for mining as this max cpu usage simply cant be explained. i am sorry for developers but this is just bad piece of software.", "distro": "Ubuntu", "karma_down": 1, "karma_up": 1, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 216873, "score": 0, "summary": "not worth your time", "user_display": "Beaver", "version": "5.6.1"}, {"app_id": "org.kde.kphotoalbum", "date_created": 1607286582.0, "description": "I use it for an image base with approx. 60000 images and it works very well. The user interface has lots of features for viewing and tagging images. All data is stored in a nice xml file.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 313287, "score": 0, "summary": "very useful", "user_display": "me", "version": "5.6.1"}]