[{"app_id": "org.openkj.OpenKJ", "date_created": 1647223543.0, "description": "\"Game\" for children..", "distro": "Kali GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 469905, "score": 0, "summary": "Joke for songs paiyng place", "user_display": "TUBECLIPS", "version": "2.0.8"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1648679186.0, "description": "I have used OpenKJ to professionally host shows for the last several years. It has become as well polished as any closed-source karaoke hostiung software I have used, and I assure you that I have bought licenses for and tried most of them.\n\nBe aware that OpenKJ does NOT include any karaoke music or subscriptions for music, so be prepared to provide tracks, yourself. I prefer that, anyhow.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 474407, "score": 0, "summary": "Fantastic for Professional Karaoke Hosts", "user_display": "Danny", "version": "stable"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1653727439.0, "description": "Especially since being distributed as a FlatPak, this just works. I use it to run my gigs and it hasn't skipped a beat. Solid playback and queue management.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_AU.UTF-8", "rating": 100, "reported": 0, "review_id": 490764, "score": 0, "summary": "It just works", "user_display": "Phil Welch", "version": "2.0.8"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1662742079.0, "description": "you have to buy songs. cannot play from your file list.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_IN", "rating": 40, "reported": 0, "review_id": 517871, "score": 0, "summary": "commercial software", "user_display": "Cruzader", "version": "2.0.8 (stable)"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1665201453.0, "description": "I've been hosting shows for twenty years and OpenKJ is as robust a platform as I've ever used. It does nearly everything something like CompUHost would do, but is faster, lighter-weight, and free.\n\nMy only criticism is that for some strange reason, Lightburn has included the option to display the next singer up between songs on the CDG display window, but this can only be used if you set the show to run itself automatically instead of manually.\n\nSo, if you set up OpenKJ to run the next singer/song's track automatically after 30 seconds, during those 30 seconds a nice \"Next up: Jane (or whomever)\" will appear on the main display, but there is no way to display this message unless you give up control of when songs begin.\n\nWhy limit this basic, necessary functionality in this way if you're already going to bother including it?", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 526651, "score": 0, "summary": "Does almost everything you could ever need", "user_display": "lividliquid", "version": "2.0.8"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1686332558.0, "description": "The negative reviews ding this as a game, and for needing to buy songs.\nThis is not a game, and you do not need to buy tracks through it.\nYou use this Program to run karaoke gigs. It's a tool. Simple as that.\nIt takes MP3+Gs, either extracted or in ZIP format, and most video formats.\nI use this professionally to run my gigs. It goes hard. 👍\nRIP Isaac, you'll be missed.", "distro": "SteamOS", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 593393, "score": 0, "summary": "Solid workhorse", "user_display": "Steam Deck User", "version": "2.0.8"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1687399555.0, "description": "I have been a KJ / DJ for over 40 years and I can tell you I have tried just about every karaoke hosting system out there. This is by far the most reliable and stable I have ever seen for the price point (FREE!). Do not pay attention to the reviews that say you have to purchase songs and cannot use your own, that is simply not true. This software will play almost anything you throw at it regardless of format or where you got it.\nIt has all of the best features required by most KJ's in the business.\nOf course, no program is perfect and there are a couple of tweaks I would like to see but nothing that makes it a deal breaker. I have been using this program for a very very long time and it has never let me down yet.\nOn a personal note, I spoke with Isaac several times directly before his untimely passing and can tell you that this was his passion and he always strived to give everyone what they wanted and paid attention to ever comment people gave him. I miss him and will continue to use the software for the long haul. HIGHLY RECOMMENDED TO ALL KJ's. Not for the casual KJ or home user. (although they could use it too).", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 594487, "score": 0, "summary": "Great application for professional hosting", "user_display": "Tom", "version": "2.0.8"}, {"app_id": "org.openkj.OpenKJ", "date_created": 1711412345.0, "description": "Isaac was a brilliant man and he loved Karaoke. I had the pleasure of calling him a friend when I lived in Nashville. Isaac died Feburary 6th, 2022. He loved programming and OpenKJ was his Opus for the Karaoke world. I use it every weekend and am reminded quite often just how talented he was and that he was taken too early in life.\nI hope someday, someone will come across his legacy and pickup where he left off. He was always looking for ways to improve OpenKJ and it was always being tweaked or he was testing different ideas. It may seem incomplete because it is. But what he left us still works 2 years later. I have a machine locked in time with his final build, thats good enough for me.\nRIP Thomas Isaac Lightburn", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 618273, "score": 0, "summary": "Taken too soon. Hopefully his software will be his Legacy", "user_display": "localadmin", "version": "2.0.8"}]