[{"app_id": "org.zrythm.Zrythm", "date_created": 1719042007.0, "description": "So, there are many reviews here that complain about various aspects of the software that do not belong to that software. \nFor example, there are people complaining about this flatpak only supporting flatpak plugins and no other plugins. Well, this is a flatpak app, so you can complain about flatpak, but not about Zrythm!\nI worked with it for some time and I can say that the user interface is really intuitive. It has (almost) no instruments pre-installed, but you can very easily get some if you extract sfz files from a sf2 file and then set the resulting directory as your sfz plugin directory. \nAlso, in my opinion the flatpak plugin system is big enough. We have the \"big\" plugins like the great ZynAddSubFX (with ZynFusion ui) and Surge here, what do we need more? Well, yes, there are many people that could port their plugins to flatpak, but that isn't the fault of Zrythm. \n\nSometimes Zrythm crashes, but remember: it's (as of now) pre-1.0 software! If we don't complain about those things but instead report the crashes (optimally even with debug info), then we can get those crashes away.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 625902, "score": 23, "summary": "Great pre-1.0 software (as of now)", "user_display": null, "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1646481976.0, "description": "Locks up system does nothing fix", "distro": "Manjaro Linux", "karma_down": 24, "karma_up": 17, "locale": "en_GB.UTF-8", "rating": 20, "reported": 1, "review_id": 467733, "score": 0, "summary": "bo good", "user_display": "Steff Skally", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1646773348.0, "description": "would be nice to try it...but cant", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 468558, "score": 0, "summary": "doesnt start after asking me to create a project", "user_display": "michael harper", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1649867224.0, "description": "Poor attempt at audio software. Program would prompt multiple errors before launch. It complained of Jack not running, even though Jack worked elsewhere. My experience led to slow performance on a relatively high end laptop.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 20, "reported": 0, "review_id": 477921, "score": 0, "summary": "You will not write 1 bar of music before problems", "user_display": "nx", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1650141900.0, "description": "Since the flatpak version will only run flatpak plguins (VST, LV2, etc), it is unusable. There is not flatpak plugins out there. You cannot use the plugins from the KX Repositories, or anything is installed as a deb, or through any repos.\n\nSince the software comes with no instruments this prevents you from using any instruments.", "distro": "LMDE", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 478653, "score": 0, "summary": "The flatpak version will only run Flatpak plugins", "user_display": "chris", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1705769625.0, "description": "On first launch the popup for choosing whether to check for updates on each startup won't close and prevents access to the software.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_AU.UTF-8", "rating": 20, "reported": 0, "review_id": 612442, "score": 0, "summary": "Update Popup Blocks Software", "user_display": null, "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1712989422.0, "description": "Urgh, the first impression after 3 minutes is not good. First I clicked on https://www.zrythm.org/en/download.html and was greeted with a subscription model which makes me very confused. Afterwards it seems like it’s only for the installer, but I don’t understand why I should use a installer if it’s on flatpack.\n\nBut then I install it from flatpack and start it. It says it’s very intuitive. I was able to create a new MIDI instrument, a bass, and then see the keyboard and grid where I can theoretically play it. But I can’t find a way to select any instrument.\n\nAfter clicking around a bit I went on YouTube to find someone explaining how to do it and found https://www.youtube.com/watch?v=WoP8on5ChUQ who explains that the free version doesn’t let you save anything. It’s a 3 years old video but I’m thinking probably I should try if the flatpack version lets me save or not.\n\nSo I look around and see the hamburger menu top right where I hope a save option would be. I click the icon, the app freezes and then crashes. So yeah … I guess that’s what you need the payed installer for?", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 619785, "score": 0, "summary": "Crash on hamburger menu", "user_display": "Jeena", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1672835739.0, "description": "A really great DAW with all the function for electronic music production (techno, psytrance, downtempo) The GUI looks very modern and tidy, I like the program very much.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 100, "reported": 0, "review_id": 552944, "score": 0, "summary": "I love this DAW!", "user_display": "arne", "version": "1.0.0"}, {"app_id": "org.zrythm.Zrythm", "date_created": 1683467354.0, "description": "Cool Daw inspired by Bitwig look.\nwould be a standard if it was finished.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 40, "reported": 0, "review_id": 587295, "score": 0, "summary": "Nice but unfinished", "user_display": "ang", "version": "1.0.0"}]