[{"app_id": "org.moneymanagerex.MMEX", "date_created": 1688314798.0, "description": "Been using MMEx since 31 May 2013 \n(I just checked, honestly had no idea it had been that long)\n\nStupid easy to setup and use. \nRecurring transactions are awesome\nForum is actually helpful\nLots of useful report options\n\nI could list a whole bunch of other ways it is better than other money managers I have tried but the best thing about MMex is that you can go as simple or as complicated as you want. \n\nWant a money manger that you can use just to track your cash flow? This is the solution. That is how I used it when I first installed it. All those other buttons/options? Just ignored them. \n\nWant a money manager to help you drill down into your budgetung and assests as well as help with saving for retirement? Works great for that as well. \n\nYes the interface is a bit dated. \n\nHowever not something that bothers me as I care way more how well something works than how good something looks. Plus I do not have to learn a new way of doing things every update like some programs. \n\nAlso there are themes to use or you can design your own. I can not personally say how well that works as it is not something I have ever bothered with.", "distro": "TUXEDO OS", "karma_down": 8, "karma_up": 3, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 595414, "score": 0, "summary": "This is the one you have been waiting for", "user_display": "Richard", "version": "1.6.4"}, {"app_id": "org.moneymanagerex.MMEX", "date_created": 1697388256.0, "description": "Most streamlined open source finance tracker. Been using it for 7 years. Especially since development has been picked up a few years ago, there is no reason not to recommend it.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 604117, "score": 0, "summary": "The Best", "user_display": "Lőrinc Serfőző", "version": "1.6.4"}, {"app_id": "org.moneymanagerex.MMEX", "date_created": 1706716726.0, "description": "All teh info is in the bank... why am I asked to create a local database and define an account? It should prompt me to add a bank, then securely log in and collect acounts, ballances and transactions; refreshing on demand. -- No it wants me to create duplicates in a local DB? Replicate manually every transaction? -- NONSENSE!", "distro": "TUXEDO OS", "karma_down": 0, "karma_up": 0, "locale": "en_GB", "rating": 20, "reported": 0, "review_id": 613404, "score": 0, "summary": "I do not see the use", "user_display": "Stephan Schutter", "version": "1.7.0"}, {"app_id": "org.moneymanagerex.MMEX", "date_created": 1714476303.0, "description": "Upon initial use, it's evident that the learning curve might deter some users. Yet, individuals with a basic grasp of technical concepts should find the setup process relatively straightforward. Once configured, its usability becomes refreshingly intuitive. Overall, it stands out as an exceptional tool, offering a plethora of features.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 100, "reported": 0, "review_id": 621278, "score": 0, "summary": "Initial Impressions: Promising!", "user_display": "Pixel", "version": "1.8.0"}]