[{"app_id": "org.fedoraproject.ibm-plex-mono-fonts", "date_created": 1670732348.0, "description": "IBM Plex Mono is a top notch monospace programming font. If you're one of those developers who spends countless hours configuring there IDE &/or editor, then this font is somthing you should check out, if you havn't already. Personally, I am very judgmental when it comes to choosing a font that I deem worthy enough for my IDE's & editors. I have tried countless free fonts, I have paid hundreds for other peoples fonts, and currently I am developing my own Monospace font with software I paid $500 dollars for. Am I ubsessive? A little, but someone has to be in order for us developers to get good quality fonts. \nHere are the reasons I like IBM Plex Mono:\n1. Open Source & Free\n2. Developed using high quality software, as a consequence, it renders well, and the better resolution your monitor/GPU supports, the better the font will render. (this is deffinatly not the case for all fonts, especially older fonts).\n3. Its glyph sets are awesome and fun, I especially like IBM Plex Mono's italic glyphs.\n\nIts not all sunshine and rainbows though. Here are 2 reasons IBM Plex Mono lost a star from this review.\n1. \"No Ligatures\" -- I was supprised to find out some people don't like ligatures, nevertheless, ligatures are highly configurable, and can be turned of completely. Today, with tons of other \"Ligature inclusive\" fonts out their, programming fonts, (to those of us who are lig lovers anyway) don't feel like a true programming font without them.\n\n2. \"Few Weights & No Variable Weight\" - It doesn't matter if its a programming font, or a chineese cursive emoji font (IDK if thats really a thing) any font IMO that doesn't come with a variable-font version, is not a first class font. Today its inexusable to not offer a variable weight. \n\nThere are deffinatly modern features missing from IBM's Plex Mono font, but that doesn't mean the typeface itself is bad, because it isn't. IBM Plex Mono has one of the best programming typefaces available. It is also one of the most unique, and that in and of its self makes it a whimsical font to use.", "distro": "Fedora Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 546993, "score": 0, "summary": "Sharpe looking, renders well, consistant, readable, unique & fun", "user_display": "JAYD3V", "version": "6.0.0"}]