[{"app_id": "org.kde.ksquares.desktop", "date_created": 1599797299.0, "description": "finally found this game on Linux", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 60, "reported": 0, "review_id": 270010, "score": 0, "summary": "Love it", "user_display": "Funny Coder", "version": "20.04.0"}, {"app_id": "org.kde.ksquares.desktop", "date_created": 1628300798.0, "description": "While I some times think it takes a extra move on larger grids it works well and AI is actually quite challenging. Classic game of wits.", "distro": "Fedora", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 80, "reported": 0, "review_id": 406809, "score": 0, "summary": "Is it me but on larger grids it cheats?", "user_display": "Gregory J Pithers", "version": "20.12.2"}, {"app_id": "org.kde.ksquares.desktop", "date_created": 1647483462.0, "description": "I remember this game from highschool, we were playing a lot! It took me to my teenage years. It s well built. Sometimes, you need to be a little bit careful where you are clicking but I suggest to press and hold mouse 1 before you put the line.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_CA.UTF-8", "rating": 100, "reported": 0, "review_id": 470726, "score": 0, "summary": "Loved it", "user_display": "yalin", "version": "21.12.2"}, {"app_id": "org.kde.ksquares.desktop", "date_created": 1558988996.0, "description": "Das Hinterhältige an diesem Spiel ist, dass man immer im Kopf behalten muss, dass der Computer als nächstes zieht. Am Anfang achte ich vor allem darauf, dass ich möglichst viele kleine Felder baue, also Bereiche von 1, 2, vier oder 6 Kästchen. Dann kann man es am ehesten so drehen, dass der Computer die kleinen Felder ausfüllen muss. Dieser wiederum versucht, möglichst lange Schläuche zu bauen. Das muss man nach Möglichkeit verhindern. Denn wenn der Computer dann so ein Feld zum Ausfüllen erhält, kommt er schnell auf über 20 oder mehr Felder, womit er das Spiel so gut wie gewonnen hat. Zum Glück kann man den Schwierigkeitsgrad des Gegners einstellen (im Gegensatz zum wirklichen Leben). Und von daher sollte ein Anfänger wirklich mit der leichtesten Stufe beginnen. Gesetzt werden bloß die schwarzen Linien, und zwar immer nur eine Seite von einem quadratischen Kästchen. Sobald drei Seiten von einem Quadrat erreicht sind, darf der nächste Spieler (bzw. der PC) dieses Feld schließen und es mit seiner Farbe füllen. Ich bin aber immer wieder überrascht, dass der PC doch noch eine Linie findet, die er gefahrlos setzen kann, so dass meistens ich diejenige bin, die als erste das Ausfüllen von Feldern anbieten muss. Aber natürlich beginne ich dann eben mit den kleinsten Komplexen zuerst. Randstücke mit 1 Feld sind natürlich die Bonbons unter den Möglichkeiten. Aber lieber nicht darauf konzentrieren, diese zu bauen, damit man nicht andere problematische Stellen übersieht. Der PC setzt seine Linien scheinbar willkürlich quer über das ganze Spielfeld, mal hier und mal dort, und in einer Affengeschwindigkeit. Deswegen muss man dann immer aufpassen, was aus diesen Linienstückchen gebaut werden könnte, um es notfalls zu boykottieren. Bitte auch immer daran denken, dass bei einem Sechser-Block eine Mittel-Linie möglich ist. Das kann einem schon mal die Nase retten, wenn man auf diese Weise nicht gleich ein Feld zum Einfärben anbieten muss. Vielleicht ist dieser Stress nicht jedermanns Sache, aber es macht einen wieder munter, wenn man so halb am Einschlafen ist... Ich liebe das Spiel, weil es so einfach aufgebaut ist und doch so genial funktioniert.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 1, "locale": "de_DE", "rating": 100, "reported": 0, "review_id": 39221, "score": 0, "summary": "Bloß immer wachsam bleiben..", "user_display": "Dorith", "version": "17.12.3"}]