[{"app_id": "pipenightdreams.desktop", "date_created": 1555969358.0, "description": "This game is a knock-off of \"Pipe Mania\" (Amiga, 1989) or \"Pipe Dream\" (Windows, 1991).\n\nIt took a few tries to figure out what the proper commands were to play the game. The title page for the game features some garish colors with no menu or instructions, aside from \"press enter to start\". Pressing enter takes the player directly to the game with no other information. Unfortunately, the enter key in the game causes the slime flow to start. The mouse does not do anything. The arrow keys are used to position pipe segments, but it is still not clear that the spacebar is the key that places a tile segment onto the grid. Are there other commands that affect the gameplay? It is impossible to know without hitting every key due to the lack of instructions.\n\nOther detractions are:\n\n* The slime flow starts very quickly. Though such a fast start to the flow might be a good challenge at later levels, it is not lenient enough at the very beginning of the game.\n* The graphics are too indistinct. Again, hard-to-read pipe segments might be a good challenge at later levels, but it seems more like an unfortunate design choice rather than a deliberately implemented challenge. It might have been better to use graphics for the pipe segments and background tiles that were easier to analyze visually. Coupled with the aggressive slime flow, beginners will likely need to take several tries to clear the very first level.\n* A bug prevents this game from closing properly on KUbuntu 18.04. Closing via the menu or (x) in the upper right corner does not work. The Ctrl+Alt+Esc shortcut needs to be used to forcibly close the game.\n\nOverall, this is a disappointing knock-off of a game that is enjoyable in other incarnations.", "distro": "Ubuntu", "karma_down": 2, "karma_up": 4, "locale": "en_US", "rating": 20, "reported": 0, "review_id": 23933, "score": 0, "summary": "An Inferior \"Pipe Mania\" Knock-off", "user_display": "Dragon", "version": "0.10.0-14build1"}, {"app_id": "pipenightdreams.desktop", "date_created": 1597662061.0, "description": "toxic design\ncumbersome gameplay\nbad system integation", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 20, "reported": 0, "review_id": 259888, "score": 0, "summary": "tragedy", "user_display": "Sonulatko", "version": "0.10.0"}, {"app_id": "pipenightdreams.desktop", "date_created": 1558993356.0, "description": "Das Spielfeld wird zu klein angezeigt, so dass man nicht alles erkennen kann. Dann ist auch extrem wenig Zeit, um die Rohre zu setzen. Immerhin kann man die Rohre drehen, indem man mehrmals die Leertaste drückt. Man muss zuerst das Feld mit den roten Linien mit den Pfeiltasten an einen sinnvollen Platz bewegen, um dann mit der Leertaste das nächste Rohr in der Warteschlange an einen passenden Platz zu setzen. Aber ich kam im besten Fall bis zum dritten Rohrstück, bevor die grüne Soße dann herausfloss. Wer also ein besseres Spielerlebnis möchte, sollte das Spiel vielleicht mit einem langsameren PC und einer niedrigeren Auflösung spielen. Ich hatte am Ende sogar noch das Problem, dass sich das Spiel nicht mehr schließen ließ, nur noch verkleinern. Mein Stern soll keine Bewertung der damaligen Programmier-Leistung darstellen sondern zielt alleine auf die aktuelle Funktionalität.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 20, "reported": 0, "review_id": 39257, "score": 0, "summary": "Wurde vermutlich für eine niedrigere Bildschirmauflösung gemacht", "user_display": "Dorith", "version": "0.10.0"}, {"app_id": "pipenightdreams.desktop", "date_created": 1589363338.0, "description": "gai adaurez lé èfét spassio avik leu vért", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR.UTF-8", "rating": 100, "reported": 0, "review_id": 207873, "score": 0, "summary": "Trau le fun", "user_display": "Justin", "version": "0.10.0"}]