[{"app_id": "redshift_tommie-lie.de", "date_created": 1609631615.0, "description": "So richtig das Rote Redshift Symbol mit dem Widget habe ich in Ubuntu 19.10 nicht gefunden aber eine Erweiterung mit Puzzelsymbol. Würde gerne Redshift in der Anwendung finden wollen und nach links in die Leiste ziehen. Nun weiß ich gar nicht, ob Redshift aktiviert ist?\nHabe aber in dem Puzzelsymbol 10000 für Tagsüb er und 2200 für Abend eingegeben, mit gut Glück werden meine trüben Augen geschont", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 80, "reported": 0, "review_id": 323516, "score": 0, "summary": "Ich hoffe das klappt", "user_display": "Adrian", "version": "unknown"}, {"app_id": "redshift_tommie-lie.de", "date_created": 1599661689.0, "description": "magnifique d'avoir un accès à la volée pour régler manuellement une localisation large ; la luminosité et la couleur sont des paramètres que j'ajuste plusieurs fois par jour voir par heure, et un accès en deux clics depuis des activités hors console est un plus appréciable ; comme le bouton ne permet que ON/OFF depuis l'utilisateur, il faut cependant sous ubuntu quelques manipulations pour changer les températures sur le clicodrome (pour allergiques au sudo repasser par \" Logiciels Ubuntu \", taper redshift, pour retrouver l'extension, et cliquer sur le bouton des paramètres : cela ouvre deux réglages sans devoir autoriser geoclue2 ; accepte une lat/long large (ex : tout un pays) et permet de tester à la volée des T° (le bouton étant accessible dès l'installation).\n\nBémol, de déplaisants retours en lumière bleue de 2 secondes max, fréquents. Je ne peux préciser si c'est à cause de Redshift, de redshift, ou encore d'un horoscope avec fox à poil dur en lune montante...\n\nP.S. pour qui voudra faire les réglages plus finement et contrôler Redshift (même si ci-dessus c'est de 'redshift' qu'on parle), c'est ici : https://doc.ubuntu-fr.org/redshift#fnt__2", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "fr_FR", "rating": 80, "reported": 0, "review_id": 269258, "score": 0, "summary": "pratique en on/off, sans accès réglages ; instabilité luminosité ?", "user_display": "Utilisateur", "version": "unknown"}]