[{"app_id": "visual-studio-code.desktop", "date_created": 1466624358.0, "description": "Learned to love it when playing around with Javascript, Typescript and AngularJS. Integrates really well with grunt or gulp. Only downside is that it's sometimes using unintuitive keybindings (which can be reconfigured).", "distro": "Arch Linux", "karma_down": 0, "karma_up": 4, "locale": "en_DE", "rating": 100, "reported": 0, "review_id": 194, "score": 0, "summary": "Incredibely good Javascript and Typescript IDE", "user_display": "Christoph Brill", "version": "1.2.1"}, {"app_id": "visual-studio-code.desktop", "date_created": 1479889718.0, "description": "I've been using Visual Studio Code as my daily driver for the past two months. I develop mostly Python and Ruby and this editor is by far the best. It come with so many conveniences like a built-in terminal, test runner, smart Jump-to-declaration and many others.\n\nAlso, the license is not exactly proprietary - source code is available under MIT.", "distro": "Arch Linux", "karma_down": 0, "karma_up": 2, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 1136, "score": 0, "summary": "Exceptional Python and Ruby support", "user_display": null, "version": "1.7.1"}, {"app_id": "visual-studio-code.desktop", "date_created": 1539977326.0, "description": "Probably the most to-the-point IDE out there, the only caveat(s) are that it does NOT include compilers/debuggers out of the box, they need to be installed on the system via package manager, and then install the appropraite extensions from a side menu, which isn't made apparent if your new to using this. Other than that, it's a clean, nice interface that has excellent easy-to-use resources like IntelliSense which can prove essential in your work. My personal favorite for managing C language projects", "distro": "Arch Linux", "karma_down": 0, "karma_up": 0, "locale": "en_US", "rating": 100, "reported": 0, "review_id": 9874, "score": 0, "summary": "Excellent C++ and C#/.NET Core IDE", "user_display": "", "version": "1.28.1-1"}]