[{"app_id": "worker.desktop", "date_created": 1614715467.0, "description": "I absolutely love this file manager. It's not every day I need a two-panel view to do my work, but when I do, I fire up my trusty Worker. It's fast as hell and looks good.\n\nI don't think Worker is for everyone, though. It does take some effort getting used to it, and getting it all set up to your own taste. You probably want to a helper script here and there to delegate to. And honestly: if it wasn't for the nostalgic memories of Directory Opus on the Amiga, I don't think I would have ever considered this tool.\n\nAnd if you never had an Amiga, you're in luck; because I did, and now I can recommend this tool to you:\n\nIf you want a blazing fast, fully (as in fully!) configurable and perhaps somewhat retro-looking file manager, look no further: for here is Worker!¹\n\n\n¹See what I did there?", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 100, "reported": 0, "review_id": 347236, "score": 0, "summary": "LOVE IT!", "user_display": "Stephan Henningsen", "version": "4.0.1"}, {"app_id": "worker.desktop", "date_created": 1629956093.0, "description": "I still use DIR OPUS on the other PC - Microsoft need to learn how it should be done and it is great on Linux", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_GB.UTF-8", "rating": 100, "reported": 0, "review_id": 413417, "score": 0, "summary": "Above review says it all", "user_display": "david liddle", "version": "4.4.0"}, {"app_id": "worker.desktop", "date_created": 1646548847.0, "description": "You remembered us with old Amiga days, Working good, But does not read arabic language as well, disappointed me :(", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 80, "reported": 0, "review_id": 467879, "score": 0, "summary": "Greetings fly to you from Egypy", "user_display": "Tahsin", "version": "4.4.0"}, {"app_id": "worker.desktop", "date_created": 1706431225.0, "description": "could not find out first how to open something in the right pane", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "en_US.UTF-8", "rating": 40, "reported": 0, "review_id": 613126, "score": 0, "summary": "double commander is better", "user_display": "Matthias", "version": "4.4.0"}, {"app_id": "worker.desktop", "date_created": 1616605999.0, "description": "i really like easy, small and old-shool programms.\nworks verry good. thanx a lot", "distro": "Debian GNU/Linux", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 100, "reported": 0, "review_id": 356132, "score": 0, "summary": "verry good", "user_display": "fujitsu-i3", "version": "3.15.4-1"}, {"app_id": "worker.desktop", "date_created": 1644784235.0, "description": "Installation und Deinstallation erfolgte unter Ubuntu 18.04", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE", "rating": 20, "reported": 0, "review_id": 463022, "score": 0, "summary": "Schade - hat sich kurz nach dem ersten Start aufgehängt !", "user_display": "jawaiwz", "version": "3.14.0"}, {"app_id": "worker.desktop", "date_created": 1658942628.0, "description": "Wer nicht nur ein \"bischen\" Dateimanager mit den allseits bekannten Funktionen haben will, sondern sich ganz kleinfieselig verschiedenste Funktionen für was auch immer \"aufs Knöpfchen\" legen will ist hier genau richtig. Für viele kleine Funktionen gibt es heute \"dicke\" grafische Apps, oftmals wird aber übersehen, das es ein kleines Skript oder ein nicht-grafisches Programm (das ist natürlich zusätzlich zu installieren und dann über Worker aufzurufen) für die gleiche Funktion genauso tut, diese Programme oder Skripte \"aufs Knöpfchen\" legen in Worker ist ein Kinderspiel und man erspart sich viel Overhead an zusätzlichen \"Kunterbunti-Programmen\" die nur Ressourcen fressen und oftmals viele Abhängigkeiten mitinstallieren (müssen). Ich benutze Worker seit ca. 15 Jahren und mag mich nicht mehr davon trennen. Ist eines der ersten Programme die ich auf einer neuinstallierten Distribution installiere. Erinnert sehr an Directory Opus auf dem Amiga. Ich kenne diese alten Sachen noch und irgendwie stört mich heutzutage zu viel \"bunt\" statt Funktion. Ich fühle mich schon geradezu unwohl mit irgendeinem nicht auf meine Bedürfnisse zugeschnittenen Dateimanager \"von der Stange\" die bei den Distributionen mitgeliefert werden. Ich war auch noch nie ein Fan von \"Drag-und Drop Maus-Rumgeschubse\" weder im Dateimanger noch im KDE, Gnome etc. - von einer Firma aus Redmond gar nicht zu reden... Die Oberfläche mag eine wenig \"oldschool\" anmuten, aber: bitte damit mal beschäftigen und ihr werdet eine ganz andere Meinung haben. Und ja, das kann ein wenig dauern bis man Worker wertschätzen lernt. Ja, es ist nicht der Optik letzter Schrei mit Opera, aber: Was ist denn wichtiger ? Die Optik oder die Funktion ? \n\nNicht nur ein \"bischen\" Dateimanager ? Richtig was zum konfigurieren ? Die vielen kleinen praktischen Scripte für Linux die man selbergebastelt hat oder im Netz gefunden hat bequem auf ein Knöpfchen legen anstatt nerviger händischer Sucherei und Starterei in der Konsole ? Dann ist Worker was für Dich!", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "de_DE.UTF-8", "rating": 100, "reported": 0, "review_id": 505829, "score": 0, "summary": "Sehr guter Dateimanager für Linux, der etwas Einarbeitung abverlangt", "user_display": "Ulf", "version": "4.0.1"}, {"app_id": "worker.desktop", "date_created": 1590346700.0, "description": "ca me change pas deja utilise sur mon MorphOs et Amiga 3.9\nmais domage il manque les traductions des langues\nBRAVO  CDL", "distro": "Ubuntu", "karma_down": 1, "karma_up": 5, "locale": "fr_FR.UTF-8", "rating": 100, "reported": 0, "review_id": 216507, "score": 0, "summary": "j'aime", "user_display": "marie", "version": "4.0.1"}, {"app_id": "worker.desktop", "date_created": 1706441586.0, "description": "Постоянно вылезают окна с предложением импортировать горячие клавиши, но дальше этого ничего не происходит.", "distro": "Ubuntu", "karma_down": 0, "karma_up": 0, "locale": "ru_RU", "rating": 20, "reported": 0, "review_id": 613136, "score": 0, "summary": "Не запускается", "user_display": "d", "version": "4.4.0-1"}]